* status_cobol_display.ws

    05  status-cobol-display.
        10 status-cobol-display1                pic x.
        10 filler                               pic x(3).
        10 status-cobol-display2                pic 9(4).
