Repository: mwhitesell-core/RMA-WPF
Catalog: WPF_PH.root/WPF_PH/WPF/rma/Rresource/Resources/Labels.*.resx
Languages: fr_ca

source: Additional Insured
fr_ca: Assuré additionnel

# COVERAGE_1
source: COVERAGE
fr_ca: COUVERTURE

# FIRMNAME_2
source: Firm Name
fr_ca: Nom de la société

source: Revenues
fr_ca: Revenus£

source: Broker Excess %
fr_ca: Broker% Excédent

source: Limit/Aggregate
fr_ca: Limite / agrégats

source: Coverage Factors
fr_ca: Facteurs de couverture

source: Offer D.A.D?
fr_ca: Offre D.A.D?

source: Unadjusted Prem
fr_ca: Prem non ajustés

source: Primary Insured
fr_ca: Assuré principal

source: FILLER[1-40]
fr_ca: CHARGE [1-40]

source: FILLER[41-80]
fr_ca: CHARGE [41-80]

source: Unadjusted Premium
fr_ca: Premium non ajustés

source: UW's Adjustment %
fr_ca: D'ajustement de l'UW

source: Adjusted Premium
fr_ca: Premium ajusté

source: Stop for stack
fr_ca: Stop à la pile

source: Eff. Rate Chg %
fr_ca: Eff. Taux Chg%

source: Deduct.
fr_ca: Moins£.

source: Excess Prem
fr_ca: Prem excès

source: Total Prem
fr_ca: Prem Total

source: Operating Budget
fr_ca: Budget de fonctionnement

source: Minimum Retained %
fr_ca: Retenue minimale%

source: Name
fr_ca: Nom

# FIRMNAME_3
source: Firm Name
fr_ca: Nom de la société

source: Address
fr_ca: Adresse

source: Postal Code
fr_ca: Code postal£

# FIRMTYPE_7
source: Firm Type
fr_ca: Le type d'entreprises

source: Rating Date
fr_ca: Date Note

source: Retro Date
fr_ca: Date Retro

source: Staff- Prof
fr_ca: Personnel-Prof£

source: Other
fr_ca: Autres

source: Fees/Rev
fr_ca: Taxes / Rev

source: DEDUCTIBLE
fr_ca: Franchise£

# COVERAGE_2
source: COVERAGE
fr_ca: COUVERTURE

source: 1 YEAR
fr_ca: 1 an

# QUOTELETTER_2
source: Quote Letter
fr_ca: Lettre Citation

source: Insured Name
fr_ca: Nom de l'assuré

# FIRMNAME_4
source: Firm Name
fr_ca: Nom de la société

# FIRMNAME_5
source: Firm Name
fr_ca: Nom de la société

source: FILLER[1-14]
fr_ca: CHARGE [1-14]

source: Quote
fr_ca: Devis£

# FIRMTYPE_8
source: Firm Type
fr_ca: Le type d'entreprises

source: BROKER CONDENSED
fr_ca: Courtier condensé

source: FILLER[96-109]
fr_ca: CHARGE [96-109]

source: Hard Costs
fr_ca: Coûts dur

source: Exist-Strc
fr_ca: Existe-STRC

source: Soft Costs
fr_ca: Frais accessoires£

source: Min Ret %
fr_ca: Ret% Min

source: Duration
fr_ca: Durée

source: Town Grade
fr_ca: Grade Town

source: Activities
fr_ca: Activités

source: Value
fr_ca: Valeur£

source: CAT-RATE
fr_ca: CAT-TAUX£

source: Amount
fr_ca: Montant

source: Blended Rate (Y/N)?
fr_ca: Taux mixte (Y / N)?

# BROKER_4
source: BROKER
fr_ca: Courtier£

source: Paragraph Name
fr_ca: Nom du paragraphe

source: Broker Name
fr_ca: Nom du courtier

source: App Logged
fr_ca: App Connecté

source: Proj Descrip
fr_ca: Descrip Proj

source: Policy Number
fr_ca: Numéro de la politique

source: Previous Policy
fr_ca: La politique précédente

# FIRMTYPE_11
source: Firm type
fr_ca: Le type d'entreprises

source: Claim Limit
fr_ca: Indemnité maximale£

source: Aggregate Limit
fr_ca: Limite globale

source: Primary Premium
fr_ca: Premium primaire

source: PREMLAYR-POOLS
fr_ca: PREMLAYR-PISCINES

source: Date Eff
fr_ca: Date d'effet

source: Date Exp
fr_ca: Date d'expiration

source: Date ERP
fr_ca: ERP Date

source: Cont Cov
fr_ca: Cov Cont

source: Total Premium
fr_ca: Premium Total

source: Treaty Premium
fr_ca: Premium traité

# DEDUCTIBLE_1
source: Deductible
fr_ca: Franchise

source: Program
fr_ca: Programme£

source: Underwriter
fr_ca: Preneur ferme£

# FIRMTYPE_12
source: Firm Type
fr_ca: Le type d'entreprises

source: Fees
fr_ca: Frais£

source: Premium Type (A/F)
fr_ca: Type Premium (A / F)£

source: Base Rate
fr_ca: Taux de base

source: Date Approved
fr_ca: Date d'approbation

source: As of Date
fr_ca: Date£

source: Company Code(or ALL)
fr_ca: Code des sociétés (ou ALL)

source: Full Limits(FULL) or Company(blank)
fr_ca: Limites complet (FULL) ou Société (blanc)

source: Contract(or blank)
fr_ca: Contrat (ou vide)

source: Company # reinsurance(or blank)
fr_ca: Société de réassurance # (ou vide)

source: FILLER[212-212]
fr_ca: CHARGE [212-212]£

# ADDITIONALINSUREDS_5
source: 'Additional Insureds'
fr_ca: Autres assurés£

# FIRMNAME_7
source: Firm Name
fr_ca: Nom de la société

# COVERAGE_3
source: COVERAGE
fr_ca: COUVERTURE

# FIRMTYPE_14
source: Firm Type
fr_ca: Le type d'entreprises

source: Your Choice
fr_ca: Votre choix

source: Your Choice (E - Exit)
fr_ca: Votre choix (E - Exit)

# RETRODATE_1
source: Retro Date
fr_ca: Date Retro

source: Pension Plan
fr_ca: Régime£

# BROKERCONDENSED_1
source: Broker Condensed
fr_ca: Courtier Condensée

# FIRMTYPE_17
source: Firm Type
fr_ca: Le type d'entreprises

# APPLOGGED_1
source: App. Logged
fr_ca: App. Connecté

source: App. Received
fr_ca: App. Reçu

source: App. Signed
fr_ca: App. Signé

source: Date Declined
fr_ca: Date Refusé£

source: Reason Code
fr_ca: Code Motif

source: Reason
fr_ca: Raison£

source: Modifiers Total
fr_ca: Modificateurs Total

source: Eff (YMD)
fr_ca: Eff (AMJ)

source: Exp (YMD)
fr_ca: Exp (AMJ)

source: Per Lm
fr_ca: Par Lm

# COVERAGE_4
source: COVERAGE
fr_ca: COUVERTURE

source: Bound Date
fr_ca: Date Bound

# FIRMTYPE_18
source: Firm Type
fr_ca: Le type d'entreprises

source: Number Requiring Coverage
fr_ca: Nombre nécessitant une couverture

source: Group Discount......
fr_ca: Rabais de groupe

# OTHER_1
source: Other...............
fr_ca: Autres

# OTHER_2
source: Other...............
fr_ca: Autres

# OFEMPL_1
source: # of Empl.
fr_ca: Nombre de Empl.

source: Copy from ISN
fr_ca: Copier à partir ISN

source: COPY FIRM
fr_ca: FERME COPY

source: Continue (Y/N)
fr_ca: Continuer (Y / N)

# FIRMTYPE_20
source: Firm Type
fr_ca: Le type d'entreprises

# APPRECEIVED_1
source: App Received
fr_ca: App Reçu

# APPSIGNED_1
source: App Signed
fr_ca: App Signé

source: First Quoted
fr_ca: D'abord cité

source: Quoted
fr_ca: Cité

source: Quote Stopped
fr_ca: Citation arrêté

source: Bind Stopped
fr_ca: Bind arrêté

source: Issued
fr_ca: De publication£

source: Mailed
fr_ca: Posté£

source: Project Desc.
fr_ca: Desc projet.

source: Quote UPDATEWHO
fr_ca: UPDATEWHO Citation

source: Do you want to DELETE?
fr_ca: Voulez-vous DELETE?

source: FILLER[15-28]
fr_ca: CHARGE [15-28]

# PROJECT_1
source: Project #
fr_ca: Projet

# PROJECTDESC_1
source: Project Desc
fr_ca: Desc projet

source: Con Value
fr_ca: Valeur Con

# FIRMTYPE_22
source: Firm Type
fr_ca: Le type d'entreprises

# APPRECEIVED_2
source: App Received
fr_ca: App Reçu

# APPSIGNED_2
source: App Signed
fr_ca: App Signé

source: Gross Premium
fr_ca: Brut£

source: Policy Limit
fr_ca: Limiter la politique

source: Effective Date
fr_ca: Date d'effet

source: Expiry Date
fr_ca: Date d'expiration

source: Layer Limit
fr_ca: Limiter Layer

source: Limit Taken
fr_ca: Limiter Taken

source: Layer Premium
fr_ca: Premium Layer

source: Primary or Excess
fr_ca: Primaire ou excédentaires£

source: Pay to Code
fr_ca: Payer pour Code

source: Reinsurer Name
fr_ca: Nom du réassureur

source: Quota Share Limit
fr_ca: Limite en quote-part

source: % of Layer Limit
fr_ca: De la limite Layer

source: % of Market ₤
fr_ca: Du marché

source: Total Commission
fr_ca: Commission Total

# FIRMNAME_9
source: Firm Name
fr_ca: Nom de la société

source: Postal
fr_ca: Postes

source: Language
fr_ca: Langue

source: Firm Status
fr_ca: Statut d'entreprise

source: Parent ISN
fr_ca: ISN Parent

source: Project Description
fr_ca: Description du projet

source: Copy to ISN
fr_ca: Copier ISN

source: FILLER[15-54]
fr_ca: CHARGE [15-54]

# FIRMTYPE_23
source: Firm Type
fr_ca: Le type d'entreprises

source: Last year's fees
fr_ca: L'an dernier, les frais

source: Fees to be used for this quote
fr_ca: Droits à être utilisés pour cette citation

source: Ratable Fees
fr_ca: Frais prorata

source: Base/Exposure Premium
fr_ca: Premium exposition Base /

# PROJECT_2
source: Project #
fr_ca: Projet

# PROJECTDESC_2
source: Project Desc
fr_ca: Desc projet

# PRESSENTERTOCONTINUE
source: Press &lt;Enter&gt; to continue
fr_ca: Appuyez sur

source: Limits
fr_ca: Limites

source: FILLER[1-18]
fr_ca: CHARGE [1-18]

# PROJECTDESCRIPTION_1
source: 'Project Description'
fr_ca: Description du projet

source: Professionals
fr_ca: Professionnels£

source: Technical
fr_ca: Technique

source: Others
fr_ca: Les autres

# FIRMNAME_11
source: Firm Name
fr_ca: Nom de la société

# FIRMNAME_12
source: Firm Name
fr_ca: Nom de la société

source: Firm
fr_ca: Cabinet£

source: Rated
fr_ca: Évaluation

# PROJECTDESC_3
source: Project Desc
fr_ca: Desc projet

source: Base Premium
fr_ca: Prime de base

source: Loss Payee
fr_ca: Bénéficiaire£

source: 'Combined Quote Selection Process'
fr_ca: Processus de sélection combinée Citation

# PROJECT_3
source: Project #
fr_ca: Projet

# CONDENSED_1
source: CONDENSED
fr_ca: Condensé£

# PROJECTDESC_4
source: Project Desc
fr_ca: Desc projet

# FIRMTYPE_29
source: Firm Type
fr_ca: Le type d'entreprises

source: Quote ID
fr_ca: ID Citation

# PROJECTDESC_5
source: Project Desc
fr_ca: Desc projet

source: Start Date
fr_ca: Début

source: End Date
fr_ca: Date de fin

source: Okay to Continue
fr_ca: D'accord pour continuer£

# FIRMTYPE_30
source: Firm Type
fr_ca: Le type d'entreprises

# APPRECEIVED_3
source: App Received
fr_ca: App Reçu

# APPSIGNED_3
source: App Signed
fr_ca: App Signé

source: Invoiced
fr_ca: Facturé

# FIRMNAME_13
source: Firm Name
fr_ca: Nom de la société

# FIRMNAME_14
source: Firm Name
fr_ca: Nom de la société

# FIRMNAME_15
source: Firm Name
fr_ca: Nom de la société

source: Competition.....
fr_ca: La concurrence

source: US..............
fr_ca: Etats-Unis ..............

source: Overseas........
fr_ca: D'outre-mer

source: Named Insured...
fr_ca: Assuré désigné ...

source: Contract........
fr_ca: Contrat

source: Jurisdiction....
fr_ca: Compétence ....

# OTHER_3
source: Other...........
fr_ca: Autres

# PROJECT_4
source: Project #
fr_ca: Projet

source: Condensed Project Name
fr_ca: Nom du projet condensé

source: Industry Code
fr_ca: Code de l'industrie

source: Add. Insured
fr_ca: Ajouter. Assuré£

source: Constr. Hard Costs
fr_ca: Cons. Coûts dur

source: Existing Structures
fr_ca: Structures existantes£

source: Duration(mths)
fr_ca: Durée (mois)

source: Starts
fr_ca: Commence

source: Completed Ops Ends
fr_ca: Terminé Ops Fin£

source: End Name 1
fr_ca: Nom Fin 1

# FIRMNAME_16
source: Firm Name
fr_ca: Nom de la société

# FIRMNAME_17
source: Firm Name
fr_ca: Nom de la société

source: Policy to be copied
fr_ca: Politique à copier

# PROJECTDESC_6
source: Project Desc
fr_ca: Desc projet

# FIRMNAME_18
source: Firm Name
fr_ca: Nom de la société

# FIRMNAME_19
source: Firm Name
fr_ca: Nom de la société

source: Description of Operations
fr_ca: Description des opérations

source: Targetting adjustment%
fr_ca: D'ajustement de ciblage

source: Targetted Premium
fr_ca: Premium ciblées

source: Proj Des
fr_ca: Des Proj

source: Proj Num
fr_ca: Num Proj

source: Construction Value
fr_ca: Valeur de la construction

source: Constr. Prem
fr_ca: Cons. Prem

source: Annual
fr_ca: Annuel

source: This year's fees
fr_ca: Cette année, les frais

source: Total Fees
fr_ca: Total des honoraires

source: Net rate
fr_ca: Taux net

# NAMEDINSUREDS_4
source: 'Named Insureds'
fr_ca: Assurés désignés

# FIRMNAME_20
source: Firm Name
fr_ca: Nom de la société

# COVERAGE_5
source: COVERAGE
fr_ca: COUVERTURE

source: Policy Wording
fr_ca: Libellé de la police

source: Carrier
fr_ca: Transporteur£

source: Layer
fr_ca: Calque£

source: Carrier Policy
fr_ca: Politique des transports

source: Per Limit(000)
fr_ca: Limite par (000)

source: Agg Limit(000)
fr_ca: Limiter Agg (000)

source: Carrier Premium
fr_ca: Premium Carrier

# FIRMTYPE_34
source: Firm Type
fr_ca: Le type d'entreprises

# APPRECEIVED_4
source: App Received
fr_ca: App Reçu

# APPSIGNED_4
source: App Signed
fr_ca: App Signé

# FIRMTYPE_35
source: Firm Type
fr_ca: Le type d'entreprises

source: Please specify the risk type
fr_ca: S'il vous plaît spécifier le type de risque

# FIRMNAME_21
source: Firm Name
fr_ca: Nom de la société

# FIRMNAME_22
source: Firm Name
fr_ca: Nom de la société

# PROJECT_5
source: Project #
fr_ca: Projet

# PROJECTDESC_7
source: Project Desc
fr_ca: Desc projet

source: Per
fr_ca: Par

source: Phone
fr_ca: Téléphone

source: Act/Dead
fr_ca: Loi / Dead

source: Fax Number
fr_ca: Numéro de télécopieur

source: Contact Email
fr_ca: Email Contact

source: Date To Pas
fr_ca: Jusqu'à la date Pas

# BROKER_NUM
source: Broker Name
fr_ca: Nom du courtier

source: Per Limit
fr_ca: Par Limit

# DEDUCTIBLE_2
source: Deductible
fr_ca: Franchise

source: Date Effect
fr_ca: Effet Date

source: Date Expires
fr_ca: Date d'échéance

source: Date Poleff
fr_ca: Poleff Date

source: Date Polexp
fr_ca: Polexp Date

source: Lim Ded Type
fr_ca: Type Lim Ded

source: Broker Pc
fr_ca: Pc Broker

source: Treaty
fr_ca: Traité

source: Std Retained
fr_ca: Std non répartis

source: TREATY-RETAIN
fr_ca: TRAITE-CONSERVER

source: MAJOR-LOC-COD
fr_ca: GRAND-LOC-COD

source: Policy Type
fr_ca: Type de politique

source: Date Effective
fr_ca: Date d'effet

# VALUE_1
source: VALUE
fr_ca: VALEUR

source: Initials
fr_ca: Initiales

source: Logon Name
fr_ca: Nom de connexion

source: Condensed Name
fr_ca: Nom Condensée

source: English Name
fr_ca: Nom anglais

source: French Name
fr_ca: Nom français

source: English Title/Position
fr_ca: Titre anglais / Position

source: French Title/Position
fr_ca: Titre français / Position

source: English Department
fr_ca: Département d'anglais

source: French Department
fr_ca: Département français

source: Signature Code
fr_ca: Code Signature

source: Supervising Sigs
fr_ca: Supervision Sigs

source: FLAGS
fr_ca: Drapeaux£

source: DATE-EXPIRES
fr_ca: DATE-EXPIRE

source: Text entity Name
fr_ca: Nom de l'entité texte

# DATEEXPIRES_1
source: Date expires
fr_ca: Date d'échéance

source: Enclosure
fr_ca: Boîtier£

source: Modifying Segment
fr_ca: Modification du segment

source: Is it changeable?
fr_ca: Est-il changer?

source: FILLER[67-121]
fr_ca: CHARGE [67-121]

source: User modifiable?
fr_ca: Modifiable par l'utilisateur?

source: Carry over-able?
fr_ca: Carry over-pouvoir?

source: Is a trailer?
fr_ca: Est-ce une remorque?

source: Stat required
fr_ca: Stat nécessaire

source: Mid-term Trailer
fr_ca: À mi-parcours Trailer

# VALUE_2
source: VALUE
fr_ca: VALEUR

source: Tables Key
fr_ca: Key Tables

source: Full Paragraph Name
fr_ca: Nom du paragraphe complet

source: New Business Name
fr_ca: Nom de la société New

source: Renewal Text Name
fr_ca: Nom Texte de renouvellement

source: Sequence Number
fr_ca: Numéro de séquence

# COVERAGE_6
source: COVERAGE
fr_ca: COUVERTURE

# VALUE_3
source: VALUE
fr_ca: VALEUR

source: POLICY NAME
fr_ca: Nom de la stratégie

source: End Name
fr_ca: Nom End

source: Effective
fr_ca: Efficace£

# PREFIX_1
source: Prefix
fr_ca: Préfixe

source: FILLER[47-91]
fr_ca: CHARGE [47-91]

source: FILLER[92-131]
fr_ca: CHARGE [92-131]

source: Mark/unmark for perm retention(X/blank)
fr_ca: Marquer / Enlever pour la rétention de Perm (X / blanc)

source: New purge date
fr_ca: Date de purge Nouveau

# PRESSENTERTOCONTINUE_1
source: Press enter to continue
fr_ca: Appuyez sur Entrée pour continuer

# InquireButton
source: Inquire
fr_ca: Renseigner

# ModifyButton
source: Modify
fr_ca: Modifier

# SUBMITBUTTON
source: Update
fr_ca: Soumettre

source: Broker Maintenance
fr_ca: Courtier d'entretien

# LISTBUTTON
source: List
fr_ca: Liste

# APPENDBUTTON
source: Append a New Detail Record
fr_ca: Ajouter un enregistrement Détail Nouveau

# FIRSTBUTTON
source: Navigate to the First Record
fr_ca: Accédez au premier enregistrement

# LASTBUTTON
source: Navigate to the Last Record
fr_ca: Accédez au dernier enregistrement

# CancelDetailButton
source: Cancel the Detail Record
fr_ca: Annuler l'enregistrement détaillé

# DeleteDetailButton
source: Delete the Detail Record
fr_ca: Supprimer l'enregistrement détaillé

# EditButton
source: Edit Detail Record
fr_ca: Modifier un dossier Détails

# BDETL_ERR_1
source: This Department is already loaded
fr_ca: Ce ministère est déjà chargé

# CorrectValidation
source: Please correct all Validation Errors to continue.
fr_ca: S'il vous plaît corriger toutes les erreurs de validation pour continuer.

# NOTIMPLEMENTED
source: This option is not yet implemented…
fr_ca: Cette option n'est pas encore mis en œuvre ...
