Repository: mwhitesell-core/RMA-WPF
Catalog: WPF_PH.root/WPF_PH/WPF/rma/Rresource/Resources/Labels.*.resx
Languages: fr_ca

# AlternateLastNameLabel
source: Alternate Last Name:
fr_ca: Nom remplaçant:

# AssociationHeader
source: Association Type
fr_ca: Type association

# AssociationTypeLabel
source: Association Type:
fr_ca: Type association:

# AssociationTypeRequired
source: An Association Type is Required.
fr_ca: Type association requis.

# Association_CampaignLabel
source: Association Campaign:
fr_ca: Campagne association:

# Association_CandidateLabel
source: Association Candidate:
fr_ca: Candidat association:

# Association_ElectoralEventLabel
source: Association Electoral Event:
fr_ca: Événement électoral association:

# Association_EventLabel
source: Association Event:
fr_ca: Événement association:

# Association_NomineeLabel
source: Association Nominee:
fr_ca: Candidat investiture association:

# CampaignRequired
source: A Campaign is Required.
fr_ca: Campagne requise.

# CanBeContactedHeader
source: Can Be Contacted
fr_ca: Peut être contacté

# CanBeContactedLabel
source: Can Be Contacted
fr_ca: Peut être contacté

# CandidateRequired
source: A Candidate is Required.
fr_ca: Candidat requis

# CanInputData
source: Allow User to Input data
fr_ca: Permettre à l'utilisateur d'entrer des données

# CaptureModeLabel
source: Capture Mode:
fr_ca: Mode capture:

# CategoryHeader
source: Category
fr_ca: Catégorie

# CategoryLabel
source: Category:
fr_ca: Catégorie:

# CategoryRequired
source: A Category is Required.
fr_ca: Catégorie requise.

# CategoryStatusHeader
source: Category Status
fr_ca: Statut catégorie

# CategoryStatusLabel
source: Category Status:
fr_ca: Statut catégorie:

# CodeExistsMessage
source: The Code already exists in this Code Table.
fr_ca: Le code existe déjà dans ce tableau.

# CodeRequired
source: Code is required.
fr_ca: Code requis.

# CodeTableDefaultSortType
source: Default Sort Type
fr_ca: Type tri par défaut

# CoffeeShopTalkHeader
source: Ad Hoc Support
fr_ca: Soutien ponctuel

# CommunicationLogButton
source: Communication Log
fr_ca: Registre de communication

# CommunicationLogDialog
source: Refresh Communication Log Data
fr_ca: Rafraîchir données du registre de communication

# CommunicationLogHeader
source: Communication Logs
fr_ca: Registres de communication

# CommunicationLogNotesHeader
source: Communication Log Notes
fr_ca: Notes du registre de communication

# ConfirmDeleteOrganizationText
source: Are you sure you want to delete this Organization?
fr_ca: Voulez-vous vraiment supprimer cette organisation?

# ConfirmLocationDeleteText
source: Are you sure you want to delete this location?
fr_ca: Voulez-vous vraiment supprimer ce lieu?

# DetailsRequired
source: Details are Required.
fr_ca: Détails requis.

# DisplayOrganizationDetailsTitle
source: Organization Details
fr_ca: Détails organisation

# DisplaySortOrderTitle
source: Display Order
fr_ca: Ordre d'affichage

# EffectiveDateMessage
source: The Effective End Date must be greater then the Effective Start Date
fr_ca: La date de fin doit être ultérieure à la date de début.

# ElectoralEventRequired
source: An Electoral Event is required.
fr_ca: Événement électoral requis.

# EnglishNameRequired
source: English Name is required.
fr_ca: Nom anglais requis.

# EnglishShortNameLabel
source: Short Name (English):
fr_ca: Nom court (anglais):

# EnglishTitleLabel
source: English Title:
fr_ca: Titre anglais:

# EnglishTitleRequired
source: An English Title is Required.
fr_ca: Titre anglais requis.

# EventRequired
source: An Event is Required.
fr_ca: Événement requis

# ExcludeIssueForAllRidings
source: Exclude Issues For All Ridings
fr_ca: Exclure enjeux pour toutes les circonscriptions

# ExecutiveFirstNameLabel
source: Exec. First Name:
fr_ca: Prénom exéc.

# ExecutiveLastNameLabel
source: Exec. Last Name:
fr_ca: Nom exéc.

# ExecutiveNameHeader
source: Executive Name
fr_ca: Nom exécutif

# ExecutiveNameLabel
source: Executive Name:
fr_ca: Nom exécutif:

# FollowupDeadlineLabel
source: Follow up Deadline:
fr_ca: Échéance du suivi:

source: For All Ridings
fr_ca: Pour toutes les circonscriptions

# FrenchNameRequired
source: French Name is required.
fr_ca: Nom français requis.

# FrenchShortNameLabel
source: Short Name (French):
fr_ca: Nom court (français):

# FrenchTitleLabel
source: French Title:
fr_ca: Titre français:

# FrenchTitleRequired
source: A French Title is Required.
fr_ca: Titre français requis.

# HasMultipleCanadianLocationsLabel
source: Multiple Canadian Locations
fr_ca: Lieux canadiens multiples

# IndustryCategoryHeader
source: Industry Category
fr_ca: Catégorie d'industrie

# IndustryCategoryLabel
source: Industry Category:
fr_ca: Catégorie d'industrie:

# IndustryHeader
source: Industry
fr_ca: Industrie

# IndustryLabel
source: Industry:
fr_ca: Industrie:

# InformationSourceLabel
source: Information Source
fr_ca: Source d'information

source: Is For All Ridings:
fr_ca: Pour toutes les circonscriptions:

# IsGlobalLabel
source: Is Global
fr_ca: Global

# IsMultiSelect
source: Allow Multiple Select
fr_ca: Permettre sélections multiples

# IssueStatusLabel
source: Issue Status:
fr_ca: Statut enjeu:

# IssueStatusRequired
source: An Issue Status is Required.
fr_ca: Statut enjeu requis.

# IssuesTitle
source: Maintain Issues
fr_ca: Maintenir enjeux

# LegalEnglishNameHeader
source: Organization Name
fr_ca: Nom organisation

# LegalEnglishNameLabel
source: Organization Name:
fr_ca: Nom organisation:

# LegalFrenchNameLabel
source: Organization Name (French):
fr_ca: Nom organisation (français):

# MailImportLabel
source: Mail/Import Processing ID:
fr_ca: ID traitement envoi/importation

# NomineeRequired
source: A Nominee is Required.
fr_ca: Candidat à l'investiture requis.

# NoteDialog
source: Refresh Note Data
fr_ca: Rafraîchir les données sur les notes

# OrganizationDetailsTitle
source: Organization Details
fr_ca: Détails organisation

source: Organization Executive Details
fr_ca: Détails organisation

# OrganizationIDLabel
source: Organization ID:
fr_ca: ID organisation:

# OrganizationLocationAddressesTitle
source: Location Addresses
fr_ca: Adresses lieu

# OrganizationLocationDetailsTitle
source: Organization Location Details
fr_ca: Détail lieu organisation

# OrganizationRequired
source: An Organization is required.
fr_ca: Organisation requise.

# OrganizationSearchNoCriteriaEntered
source: You must enter search criteria! You must enter an Organization Name and Type.
fr_ca: Vous devez entrer des critères de recherche! Vous devez entrer un nom d'organisation.

# OrganizationSearchTitle
source: Organization Search
fr_ca: Recherche organisation

# OrganizationShortEnglishLabel
source: Organization Short English Name:
fr_ca: Nom court organisation anglais:

# OrganizationShortFrenchLabel
source: Organization Short French Name:
fr_ca: Nom court organisation français:

# OrganizationStatusLabel
source: Organization Status:
fr_ca: Statut organisation:

# OrganizationsTitle
source: Maintain Organizations
fr_ca: Maintenir organisations

# OrganizationTypeHeader
source: Organization Type
fr_ca: Type organisation

# OrganizationTypeLabel
source: Organization Type:
fr_ca: Type organisation:

# OutcomeTypeLabel
source: Outcome Type:
fr_ca: Type résultat:

# OwnerLabel
source: Owner:
fr_ca: Propriétaire:

# ParentLookupNameLabel
source: Parent Name
fr_ca: Nom parent

# PollRequired
source: A Poll is required.
fr_ca: Bureau de scrutin requis.

source: Primary Contact Alternative FirstName
fr_ca: Prénom alternatif contact principal:

source: Primary Contact Alternative LastName:
fr_ca: Nom alternatif contact principal:

# PrimaryContactConstituentIDLabel
source: Primary Contact Constituent ID:
fr_ca: ID électeur contact principal:

# PrimaryContactConstituentNameLabel
source: Primary Contact Name:
fr_ca: Nom contact principal:

# PrimaryFirstNameLabel
source: Primary First Name:
fr_ca: Prénom contact principal:

# RetrieveMaintainIssues
source: Retrieve and Maintain Issues
fr_ca: Récupérer et maintenir enjeux

# RetrieveMaintainIssuesDetails
source: Issues Details
fr_ca: Détails enjeux

# RidingHeader
source: Riding
fr_ca: Circonscription

# RidingRequired
source: Is for All Riding or an Individual Riding must be selected.
fr_ca: Toutes les circonscriptions ou sélectionner une circonscription.

# RoleStatusHeader
source: Role Status
fr_ca: Statut rôle

# RoleStatusLabel
source: Role Status:
fr_ca: Statut rôle:

# RoleTypeHeader
source: Role Type
fr_ca: Type rôle

# RoleTypeLabel
source: Role Type:
fr_ca: Type rôle:

# SearchOnlyAllRidings
source: Search Only Issues For All Ridings
fr_ca: Rechercher enjeux seulement toutes circonscriptions

source: Search Organizations
fr_ca: Rechercher organisations

# TabItemExecutive
source: Executive
fr_ca: Exécutif

# TabItemOrganization
source: Organization
fr_ca: Organisation

# TaskButton
source: Tasks
fr_ca: Tâches

# TemplateLabel
source: Template:
fr_ca: Modèle:

# TitleHeader
source: Title
fr_ca: Titre

# UserIDLabel
source: User ID
fr_ca: Titre

# VotingLocationDetailsTitle
source: Voting Location Details
fr_ca: Détails lieu de scrutin

# WebsiteAddressHeader
source: Website
fr_ca: Site Web

# WebsiteAddressLabel
source: Website:
fr_ca: Site Web:

# AddOrganizationsTitle
source: Add Organization
fr_ca: Ajouter organisation

# ExecutiveDetailsFieldsRequired
source: Role Type, Title and Role Status are required.
fr_ca: Type de rôle, titre et statut de rôle requis.

# ExecutiveNameIsRequired
source: Please select a Constituent or enter an alternate First Name and alternate Last Name
fr_ca: Veuillez choisir un électeur ou entrer enter un prénom et un nom de remplaçant

# LocationAddressDetailsTitle
source: Location Address Details
fr_ca: Détail adresse du lieu

# OrganizationExecutiveDetailsTitle
source: Organization Executive Details
fr_ca: Détail exécutif organisation

# OrganizationWildcardDescription
source: ** Use the * to perform wildcard searches. A wildcard search can be performed by adding the * sign to the search criteria. (i.e. To search for an Organization starting with 'D', enter 'D*'). Note, you cannot use the wildcard character as the first character.
fr_ca: ** Utilisez le * pour faire une recherche avec caractère de remplacement. On peut faire cette recherche en ajoutant * dans les critères. (Exemple: Pour chercher une organisation commençant par D, entrer D*). Vous ne pouvez pas utiliser le caractère de remplacement comme premier caractère.

# InvalidWebsiteAddress
source: Website Address is invalid.
fr_ca: Adresse Web invalide.

# ConfirmExecutiveDeleteText
source: Are you sure you want to delete this Executive?
fr_ca: Voulez-vous vraiment supprimer cet exécutif?

# GroupingMessage
source: Drag a column header and drop it here to group by that column
fr_ca: Faites glisser un titre de colonne ici pour regrouper cette colonne

# FamilyLabel
source: Family
fr_ca: Famille

# PhoneLabel
source: Phone
fr_ca: Téléphone

# FundCodesTitle
source: Maintain Fund Codes
fr_ca: *F* Maintain Fund Codes *F*

# EDAHeader
source: EDA %
fr_ca: *F* EDA % *F*

# FundCodeHeader
source: Fund Code
fr_ca: *F* Fund Code *F*

# FundCodeNameHeader
source: Fund Code Name
fr_ca: *F* Fund Code Name *F*

# GLAccountHeader
source: G/L Account
fr_ca: *F* G/L Account *F*

# LastUpdatedDateHeading
source: Modified Date
fr_ca: *F* Modified Date *F*

# EDAPercentageLabel
source: Shared Revenue (EDA %):
fr_ca: *F* Shared Revenue (EDA %): *F*

# ExpireButton
source: Expire
fr_ca: *F* Expire *F*

# FundCodeDescriptionLabel
source: Description:
fr_ca: *F* Description: *F*

# FundCodeDetailsTitle
source: Fund Code Details
fr_ca: *F* Fund Code Details *F*

# FundCodeLabel
source: Fund Code:
fr_ca: *F* Fund Code: *F*

# FundCodeNameLabel
source: Fund Code Name:
fr_ca: *F* Fund Code Name: *F*

# GLAccountLabel
source: G/L Account:
fr_ca: *F* G/L Account: *F*

# GLAccountNote
source: Note: To change a G/L Account, the current Fund Code will need to be Expired and a new Fund Code must be created with the updated G/L Account.
fr_ca: *F* Note: To change a G/L Account, the current Fund Code will need to be Expired and a new Fund Code must be created with the updated G/L Account. *F*

# EUADSNLabel
source: rma
fr_ca: Système politique rma

# EUWDSNLabel
source: rma
fr_ca: Système politique rma

# MISDSNLabel
source: A&E WORKING DESIGN
fr_ca: A & E DESIGN DE TRAVAIL

source: Invoicing
fr_ca: Facturation£

source: Endorsements
fr_ca: Approbations£

source: Customize and Print...
fr_ca: Personnaliser et imprimer ...

source: Customize and/or Print Dec Page
fr_ca: Personnaliser et Imprimer la page / ou décembre

source: Print Policy Package
fr_ca: Paquet politique d'impression

source: Print Endorsements
fr_ca: Les visas d'impression

source: Image Policies for Claims
fr_ca: Les politiques d'image pour des revendications

source: Sub-limits...
fr_ca: Sous-limites ...

source: Coverage GL
fr_ca: GL couverture

source: Coverage BR/WU/CG/PP
fr_ca: BR Couverture / WU / CG / PP

source: Underlying Carriers
fr_ca: Les transporteurs sous-jacents£

source: Installments
fr_ca: Versements£

source: Certificates of Insurance
fr_ca: Certificats d'assurance

source: Broker Swap...
fr_ca: Swap Broker ...

source: Before Invoicing
fr_ca: Avant de facturation

source: After Invoicing
fr_ca: Après la facturation

source: Offset/Rebill
fr_ca: Offset / refacturation

source: Cancel/Reinstate/Lapse...
fr_ca: Annuler / Rétablir / Échéance ...

source: Cancel
fr_ca: Annuler

source: Reinstate
fr_ca: Rétablir

source: Lapse
fr_ca: Déchéance£

source: Print Cancel Notice
fr_ca: Annuler l'impression Avis

source: Policy System updates/reports
fr_ca: Politique de mises à jour système / rapports

source: Stat-Detl Update
fr_ca: Mise à jour de Stat-DETL

source: Underwriter/Assistant Update
fr_ca: Assureur / mise à jour Assistant

source: Small Reports
fr_ca: Rapports petits

source: Print a Minimum Premium Table - TESTLASR
fr_ca: Impression d'un tableau de primes minimales - TESTLASR

source: Print IL Factors - TESTLASR
fr_ca: Facteurs IL Imprimer - TESTLASR

source: Esteem Broker Stats Menu
fr_ca: Courtier Esteem Stats Menu

source: Esteem Brokers Policies In-force as of
fr_ca: Les courtiers Esteem polices en vigueur du

source: Esteem Brokers Inforce Volume - P&C
fr_ca: Les courtiers Esteem Inforce Volume - P

source: Load blank end. for a policy
fr_ca: Fin de charge vide. Pour une politique

source: Mark/unmark documents for permanent ret.
fr_ca: Documents Mark / démarquer pour ret permanente.

source: AE Tables Detail update
fr_ca: Mise à jour tableaux AE Détails£

source: TEXT Table & Xable Maintenance
fr_ca: Tableau TEXT

source: Quote Paragraph Labels
fr_ca: Les étiquettes paragraphe Citation

source: Quote Letter Attachment Phrases
fr_ca: Phrases Citation Lettre jointe£

source: TEXT.Tables-detl Update
fr_ca: TEXT.Tables-DETL mise à jour

source: Quote Letter Paragraph Text update
fr_ca: Citation Lettre paragraphe du texte mise à jour

source: Edit Generic letter templates
fr_ca: Modifier la lettre générique modèles

source: Edit Dec pages or Cover Letter templates
fr_ca: Modifier les pages décembre ou modèles de lettre d'accompagnement

source: Endorsement Text update
fr_ca: Mise à jour du texte avenant

source: Edit Policy Wording
fr_ca: Modifier libellé de la police

source: XABLE-PARA-DETL Maintenance
fr_ca: Maintenance XABLE-PARA-DETL

source: Modify a Custom-detl Text Document
fr_ca: Modifier un Custom-DETL Document texte

source: BEAM TO ANY SPEEDWARE ACTION
fr_ca: Faisceau de toute action de Speedware

source: Copy templates en masse
fr_ca: Copier modèles en masse

source: Copy templates by NAME
fr_ca: Copier modèles par son nom

source: Delete templates en masse
fr_ca: Suppression de modèles en masse

source: Copy TABLE-DETL records
fr_ca: Copier les dossiers TABLE-DETL

source: Delete dangling TEXT-DETL records
fr_ca: Supprimer les dossiers pendants TEXTE DETL

source: MPE/XL COMMAND INTERPRETTER
fr_ca: MPE / XL INTERPRETTER COMMAND

source: Data Entry...
fr_ca: Entrée de données ...

source: Brokers
fr_ca: Courtiers£

source: Insureds...
fr_ca: Les assurés ...

source: AE Insureds...
fr_ca: Les assurés AE ...

source: Named Insureds
fr_ca: Assurés désignés

source: Named Insureds - Projects
fr_ca: Assurés désignés - Projets

source: Additional Insureds
fr_ca: Autres assurés£

source: Attached Firms - Projects
fr_ca: Les entreprises ci-joint - Projets

source: Predecessor Firms
fr_ca: Les entreprises prédécesseur

source: SRD Insureds...
fr_ca: Les assurés SRD ...

# NAMEDINSUREDS_1
source: Named Insureds
fr_ca: Assurés désignés

# ADDITIONALINSUREDS_1
source: Additional Insureds
fr_ca: Autres assurés£

source: Coins Insureds...
fr_ca: Les assurés pièces ...

# NAMEDINSUREDS_2
source: Named Insureds
fr_ca: Assurés désignés

# ADDITIONALINSUREDS_2
source: Additional Insureds
fr_ca: Autres assurés£

source: Named Insureds Projects
fr_ca: Nommé projets assurés

source: Additional Insureds Projects
fr_ca: D'autres projets assurés

source: DO Insureds...
fr_ca: NE assurés ...

# NAMEDINSUREDS_3
source: Named Insureds
fr_ca: Assurés désignés

# ADDITIONALINSUREDS_3
source: Additional Insureds
fr_ca: Autres assurés£

source: Application Entry...
fr_ca: Entrée de l'application ...£

source: Practice Fees
fr_ca: Frais de pratique

source: Practice Quote Modifiers
fr_ca: Modificateurs Citation Practice

source: Project Quote Modifiers
fr_ca: Modificateurs Citation Project

source: Coins Project Details
fr_ca: Coins Détails du projet

source: Print Label
fr_ca: Label Print£

source: Project Description AE
fr_ca: AE Description du projet

source: Project Description Coins
fr_ca: Coins Description du projet

source: Delete Application
fr_ca: Supprimer la demande

source: Underwriting...
fr_ca: Souscription ...

source: Insured Information...
fr_ca: Information assuré ...

source: Quote/Policy Summary
fr_ca: Sommaire de la politique Quote /

source: Policy Details
fr_ca: Détails de la politique

source: Policy History
fr_ca: Histoire politique

source: Progress Inquiry
fr_ca: Enquête d'avancement

source: Progress History Inquiry
fr_ca: L'enquête Histoire Progress

# COINSPROJECTDETAILS_1
source: Coins Project Details
fr_ca: Coins Détails du projet

source: Coins Project Description
fr_ca: Description du projet Coins

source: Coins Market Area Inquiry
fr_ca: Enquête Coins zone de marché

source: Accounting Inquiry
fr_ca: Enquête comptable

source: PAS Broker Multi-key Search
fr_ca: Recherche Broker PAS Multi-clé

source: AE Rating...
fr_ca: Note AE ...

source: Practice
fr_ca: Pratique

source: Project
fr_ca: Projet£

source: Individual
fr_ca: Particulier£

source: Small Firms
fr_ca: Les petites entreprises

source: SRD Rating...
fr_ca: Classement SRD ...

source: Generic
fr_ca: Générique£

source: Table Rating
fr_ca: Classement tableau

source: Coins Rating...
fr_ca: Evaluation des monnaies ...

source: Rating
fr_ca: Evaluation

source: Sub Limits/Deductibles
fr_ca: Limites Sous / franchises

source: Create a Renewal Quote
fr_ca: Créer un devis de renouvellement

source: Cresta Zone Report
fr_ca: Rapport Zone Cresta

source: Policy Register Report
fr_ca: Rapport registre politique

source: DO Rating...
fr_ca: NE Evaluation ...

source: Generic Rating
fr_ca: Classement générique

source: Quote Letter...
fr_ca: Lettre Citation ...

# QUOTELETTER_1
source: Quote Letter
fr_ca: Lettre Citation

source: Summary Rate Sheet
fr_ca: Fiche de tarifs Résumé

source: UW Comments by Client
fr_ca: Commentaires UW par le client

source: UW Comments by Project
fr_ca: Commentaires UW par le Projet

source: Convert Quote to AIM
fr_ca: Convertir Citation à AIM

source: Decline
fr_ca: Refuser

source: Bind & Beyond...
fr_ca: Bind

# INSUREDINFORMATION_1
source: Insured Information...
fr_ca: Information assuré ...

# QUOTEPOLICYSUMMARY_1
source: Quote/Policy Summary
fr_ca: Sommaire de la politique Quote /

# POLICYDETAILS_1
source: Policy Details
fr_ca: Détails de la politique

# POLICYHISTORY_1
source: Policy History
fr_ca: Histoire politique

# PROGRESSINQUIRY_1
source: Progress Inquiry
fr_ca: Enquête d'avancement

# PROGRESSHISTORYINQUIRY_1
source: Progress History Inquiry
fr_ca: L'enquête Histoire Progress

# COINSPROJECTDETAILS_2
source: Coins Project Details
fr_ca: Coins Détails du projet

# COINSPROJECTDESCRIPTION_1
source: Coins Project Description
fr_ca: Description du projet Coins

# COINSMARKETAREAINQUIRY_1
source: Coins Market Area Inquiry
fr_ca: Enquête Coins zone de marché

# ACCOUNTINGINQUIRY_1
source: Accounting Inquiry
fr_ca: Enquête comptable

# PASBROKERMULTI_KEYSEARCH_1
source: PAS Broker Multi-key Search
fr_ca: Recherche Broker PAS Multi-clé

source: Mail Room
fr_ca: Salle du courrier

source: Claims System...
fr_ca: Système de Réclamations ...

source: Non Profit Auto Renewal...
fr_ca: Non-renouvellement automatique Profit ...

source: Create NP Renewal Quote
fr_ca: Créer devis de renouvellement NP

source: Non Profit Auto Renewal Rating
fr_ca: Note non renouvellement Profit Auto

source: Print Summary Rate Sheet
fr_ca: Fiche de tarifs Imprimer Résumé

source: Copy ISN to Phantom
fr_ca: ISN Copier Phantom

source: Phantom System...
fr_ca: Système de Phantom ...

source: Move ISN to Real
fr_ca: ISN transfert au Real

source: Phantom Outstanding Report
fr_ca: Rapport Phantom exceptionnelle

source: Delete ISN from Phantom
fr_ca: Supprimer ISN du Fantôme

source: Fax System...
fr_ca: Système de télécopie ...

source: Reports & Updates...
fr_ca: Rapports

source: Summary System...
fr_ca: Résumé du système ...

source: Data Extract for Renewal Letters
fr_ca: Extrait de données de lettres de renouvellement

source: Data Extract for Anniversary Letters
fr_ca: Extrait de données de lettres anniversaire

source: Print Expiring Project Certificates
fr_ca: Imprimer venant à échéance certificats de projet

source: Destroyed Status Update
fr_ca: Mise à jour de statut Destruction

source: Now Forward UW Barcode File Extract
fr_ca: Maintenant, avant UW fichier de code à barres Extrait

source: Beam & Beyond >>>
fr_ca: Beam

source: Broker
fr_ca: Courtier£

source: Firm name
fr_ca: Nom de la société

source: Condensed
fr_ca: Condensé£

source: Policy
fr_ca: Politique£

source: Proj Desc
fr_ca: Desc Proj

source: Modified Premium
fr_ca: Premium Mise à jour

source: Claim Experience
fr_ca: L'expérience de réclamation

source: No Prior Liab...
fr_ca: Non Liab Avant ...

source: Main Practice...
fr_ca: La pratique principale ...

source: Volume Discount.
fr_ca: Rabais sur volume.

source: Exposure Premium
fr_ca: Premium exposition

source: Coverage
fr_ca: Couverture£

source: Assets
fr_ca: Actifs£

source: Market Cap
fr_ca: Cap marché

source: Pen Plan CA
fr_ca: CA Plan Pen

source: US Subsidiaries
fr_ca: Filiales américaines

source: # of Empl
fr_ca: Nombre de Empl

source: Staff Size US
fr_ca: Taille du personnel des États-Unis£

source: Staff size foreign
fr_ca: Le personnel de taille étrangers

source: US Equity
fr_ca: Actions américaines

source: U.S. Assets
fr_ca: U. S. actifs

source: U.S. Sales
fr_ca: U. S. ventes

source: U.S. Total credits
fr_ca: U. S. Total des crédits

source: Which Selection
fr_ca: Quels choix

source: 'Limits/Deductibles'
fr_ca: Limites / franchises

source: Per-claim Limits
fr_ca: Limites par la revendication

source: Deductibles
fr_ca: Franchises

source: Coverage Types
fr_ca: Types de couverture

source: Choose Options
fr_ca: Choisir les options

source: Customer
fr_ca: Client£

source: Please enter the declination reason
fr_ca: S'il vous plaît indiquer le motif de la déclinaison

source: Client Status
fr_ca: État du client

source: Client Name
fr_ca: Nom du client

# FIRMNAME_1
source: Firm Name
fr_ca: Nom de la société

# ADDITIONALINSUREDS_4
source: 'Additional Insureds'
fr_ca: Autres assurés£

source: Project Number
fr_ca: Numéro du projet

source: Condensed Proj Desc
fr_ca: Desc Condensée Proj
