Repository: mwhitesell-core/RMA-WPF
Catalog: WPF_PH.root/WPF_PH/WPF/rma/Rresource/Resources/Labels.*.resx
Languages: fr_ca

# AboutPageTitle
source: About
fr_ca: De

# ActivityLoadingUser
source: Initializing Application....
fr_ca: Application d'initialisation...

# ActivityLoggingIn
source: Logging in...
fr_ca: Abonner...

# ActivityRegisteringUser
source: Submitting Registration...
fr_ca: Enregistrement soumettant...

# AlreadyRegisteredLabel
source: Already registered?
fr_ca: Déjà inscrit?

# BackToLoginButton
source: Back to Login
fr_ca: De retour au Login

# CancelButton
source: Cancel
fr_ca: Annuler

# ErrorBadUserNameOrPassword
source: The user name or password is incorrect
fr_ca: L'identifiant ou le mot de passe est inexact

# ErrorLoginAfterRegistrationFailed
source: Registration was successful but there was a problem while trying to log in with your credentials: {0}
fr_ca: L'enregistrement était réussi mais il y avait un problème pendant qu'essayer d'abonner avec vos qualifications: {0}

# ErrorWindowErrorDetails
source: Error Details
fr_ca: Détail de l'erreur

# ErrorWindowGenericError
source: An unknown error has occurred. Please contact your administrator for help
fr_ca: Une erreur inconnue est survenue. Veuillez contacter l'administrateur.

# ErrorWindowTitle
source: Error
fr_ca: Erreur

# HomePageTitle
source: Home
fr_ca: Accueil

# LogOffButton
source: logout
fr_ca: sortie du système

# NotRegisteredYetLabel
source: Not registered yet?
fr_ca: Pas inscrit pourtant?

# RegisterNowButton
source: Register now
fr_ca: Enregistrer maintenant

# RegistrationFormHeader
source: Please complete all required fields to create your account
fr_ca: S'il vous plaît compléter tous champs exigés pour créer votre compte

# RegistrationWindowTitle
source: Register
fr_ca: Registre

# RememberMeLabel
source: Keep me signed in
fr_ca: Garder m'a signé dans

# WelcomeMessage
source: Welcome {0}
fr_ca: Bienvenue {0}

source: Add Constituents
fr_ca: Ajouter des électeurs

# CallListsButton1
source: CALL LISTS
fr_ca: LISTES D'APPEL

# CallListsButton2
source: INSTRUCTIONS: Generate and manage
fr_ca: INSTRUCTIONS: Produire et gérer

# CallListsButton3
source: your Call Lists.
fr_ca: vos Listes d'Appel.

# ConstituentButton1
source: CONSTITUENTS
fr_ca: ÉLECTEURS

# ConstituentButton2
source: INSTRUCTIONS: Manage all aspects
fr_ca: INSTRUCTIONS: Gérer tous les aspects

# ConstituentButton3
source: of Constituents.
fr_ca: d'électeurs.

source: Data Processing
fr_ca: Traitement des données

# DidYouKnowExpanderHeaderText
source: DID YOU KNOW?
fr_ca: LE SAVIEZ-VOUS?

# DidYouKnowLabel
source: On October 16th, 2003 the leaders of the Canadian Reform Conservative Alliance and the Progressive Conservative Party of Canada announced an agreement in principle under a new political banner.
fr_ca: Le 16 octobre 2003, les dirigeants de l'Alliance réformiste conservatrice canadienne et du Parti progressiste-conservateur du Canada ont annoncé une entente de principe sous une nouvelle bannière politique.

source: Document Scanner
fr_ca: Scanner de documents

# DonationsButton1
source: DONATIONS
fr_ca: DONS

# DonationsButton2
source: INSTRUCTIONS: Enter and view
fr_ca: INSTRUCTIONS: Entrer et regarder

# DonationsButton3
source: donations to CPC.
fr_ca: des donations à CPC.

# EventsButton1
source: EVENTS
fr_ca: ÉVÉNEMENTS

# EventsButton2
source: INSTRUCTIONS: Schedule and view
fr_ca: INSTRUCTIONS: Planifier et regarder tous

# EventsButton3
source: all CPC events.
fr_ca: les événements de CPC.

# HelloLabel
source: Hello
fr_ca: Salut

# HelloMessageExpanderHeaderText
source: Hello
fr_ca: Salut

# HelpLabel
source: HELP
fr_ca: AIDE

# HomeButton
source: HOME
fr_ca: ACCUEIL

# InformationButton1
source: More
fr_ca: Plus

# InformationButton2
source: More
fr_ca: Plus

# InformationButton3
source: Search
fr_ca: Recherche

# InformationLabel1
source: Welcome to the rma Policy System! If you need assistance with the features of this app...
fr_ca: Bienvenue sur le System politique rma! Si vous avez besoin d'aide avec les fonctionnalités de cette application ...

# InformationLabel2
source: The buttons below reflect the tasks that you can perform. Return to this screen...
fr_ca: Les boutons ci-dessous indiquent les tâches que vous pouvez exécuter. Retour à cet écran…

# InformationLabel3
source: Enter your search terms below. If you need further assistance, please use the SUPPORT link.
fr_ca: Entrez les termes de recherche ci-dessous. Si vous avez besoin d'aide, utilisez le lien SUPPORT.

# LanguageButton
source: FRANÇAIS
fr_ca: ENGLISH

source: Mail Merge
fr_ca: Publipostage

# MessageLabel
source: Welcome to the rma Policy system! If you need assistance with the features of this application, please use the 'Help' button located in the main menu.
fr_ca: Bienvenue dans le système politique rma! Si vous avez besoin d'aide avec les fonctionnalités de cette application, s'il vous plaît utilisez le bouton «Aide£ situé dans le menu principal.

# ReportsButton1
source: REPORTS
fr_ca: RAPPORTS

# ReportsButton2
source: INSTRUCTIONS: Generate and print
fr_ca: INSTRUCTIONS: Produire et imprimer

# ReportsButton3
source: various reports.
fr_ca: rapports divers.

source: Search Constituents
fr_ca: Recherche d'électeurs

# TabItemCallLists
source: CALL LISTS
fr_ca: LISTES D'APPEL

# TabItemConstituents
source: CONSTITUENTS
fr_ca: ÉLECTEURS

# TabItemDonations
source: DONATIONS
fr_ca: DONS

# TabItemEvents
source: EVENTS
fr_ca: ÉVÉNEMENTS

# TabItemHome
source: HOME
fr_ca: ACCUEIL

# TabItemReports
source: REPORTS
fr_ca: RAPPORTS

# TabItemVolunteers
source: VOLUNTEERS
fr_ca: BÉNÉVOLES

# TabItemWalkLists
source: WALK LISTS
fr_ca: MARCHE DES LISTES

# VolunteersButton1
source: VOLUNTEERS
fr_ca: BÉNÉVOLES

# VolunteersButton2
source: INSTRUCTIONS: Manage all CPC
fr_ca: INSTRUCTIONS: Gérer tous les

# VolunteersButton3
source: volunteers.
fr_ca: volontaires de CPC.

# WalkListsButton1
source: WALK LISTS
fr_ca: MARCHE DES LISTES

# WalkListsButton2
source: INSTRUCTIONS: Review and generate
fr_ca: INSTRUCTIONS: Réexaminer et produire

# WalkListsButton3
source: your walk lists.
fr_ca: vos listes de promenade.

# AddressColumnHeader
source: ADDRESS
fr_ca: ADRESSE

# AdvancedFieldsLabel
source: Show Advanced Fields?
fr_ca: Champs avancés?

# BirthDateLabel
source: Birth Date:
fr_ca: Anniversaire:

# CanadianCitizenLabel
source: Canadian Citizen
fr_ca: Citoyen canadien

# CityLabel
source: City:
fr_ca: Ville:

# CivicAddressLabel
source: Civic Address:
fr_ca: Adresse Civique:

# ConstituentDetailsHeaderText
source: CONSTITUENT DETAILS
fr_ca: LE CONSTITUANT DETAILLE

# ConstituentInfoTabHeader
source: Constituent Info
fr_ca: Info de constituant

# ConstituentNumberLabel
source: Constituent No.:
fr_ca: Constituant No.:

# ContactInformationLabel
source: Contact Information:
fr_ca: Coordonnées:

# EmailAddressLabel
source: Email Address:
fr_ca: Adresse de courriel:

# FemaleGenderLabel
source: Female
fr_ca: Femelle

# FirstNameLabel
source: First Name:
fr_ca: Prénom:

# GenderLabel
source: Gender:
fr_ca: Sexe:

# InitialLabel
source: Initial:
fr_ca: Initiale:

# LastNameLabel
source: Last Name:
fr_ca: Nom:

# MailingInformationLabel
source: Mailing Information:
fr_ca: Information postale:

# MaleGenderLabel
source: Male
fr_ca: Mâle

# MemberColumnHeader
source: MEMBER?
fr_ca: MEMBRE?

# MemberIDLabel
source: Member ID:
fr_ca: Membre ID:

# MunicipalityLabel
source: Municipality:
fr_ca: Municipalité:

# NameColumnHeader
source: NAME
fr_ca: NOM:

# NoLabel
source: No
fr_ca: Non

# PersonalInformationLabel
source: Personal Information:
fr_ca: Informations Personnelles

# PhoneColumnHeader
source: PHONE
fr_ca: *F* TELEPHONE: *F*

# PhoneNumberLabel
source: Phone #:
fr_ca: Téléphone:

# POBoxLabel
source: PO Box:
fr_ca: PO Boîte:

# PollLabel
source: Poll:
fr_ca: Scrutin:

# PostalCodeLabel
source: Postal Code:
fr_ca: Code postal:

# PreferredNameLabel
source: Preferred Name:
fr_ca: Nom Préféré

# PrimaryAddressLabel
source: Primary Address?
fr_ca: Adresse Primaire?

# ResetButton
source: Reset
fr_ca: Réinitialiser

# ResultsButton
source: Results
fr_ca: Résultats

# RevisionHistoryButton
source: REVISION HISTORY
fr_ca: HISTOIRE DE REVISION

# RidingIDLabel
source: Riding ID:
fr_ca: Prendre ID:

# RouteLabel
source: Route Srv. Type:
fr_ca: Type de service:

# SalutaionLabel
source: Salutation:
fr_ca: Appel:

# SearchButton
source: Search
fr_ca: Recherche

# SearchConstituentsHeaderText
source: SEARCH CONSTITUENTS
fr_ca: RECHERCHE D'ELECTEURS

# SearchResultsLabel
source: SEARCH RESULTS
fr_ca: RÉSULTATS DE LA RECHERCHE

# ServiceNumberLabel
source: Service No.:
fr_ca: No service:

# StreetNameLabel
source: Street Name:
fr_ca: Nom rue:

# StreetNumberLabel
source: Street #:
fr_ca: No rue:

# SupporterLabel
source: Supporter
fr_ca: *F* Supporter *F*

# SupportLevelColumnHeader
source: SUPPORT LVL
fr_ca: NIVEAU DE SOUTIEN

# TitleLabel
source: Title:
fr_ca: Titre:

# UpdateButton
source: Update
fr_ca: Mise à jour

# VoterIDLabel
source: Voter ID:
fr_ca: Electeur ID:

# VoterInfoLabel
source: Voter Info
fr_ca: Informations d'électeur

# YesLabel
source: Yes
fr_ca: Oui

source: Details:
fr_ca: Détails

source: Donations
fr_ca: Dons

source: Donations To Party:
fr_ca: Dons au Parti:

source: Eligible Voters
fr_ca: Électeurs admissibles

source: MyRiding
fr_ca: Mon Prendre

source: Identified Supporters
fr_ca: Supporters identifiés:

source: Number of Lawn Signs:
fr_ca: Le nombre de Signes de Pelouse:

source: Number of Polls:
fr_ca: Le nombre de Sondages:

source: Number of Streets:
fr_ca: Le nombre de Rues:

source: Other Party Donations
fr_ca: Autres dons au Parti

source: Undecided Voters:
fr_ca: Electeurs indécis:

source: Voters/Supporters
fr_ca: Electeurs/supporters

# ChangesSuccessfulMessage
source: Changes submitted successfully.
fr_ca: Les changements ont soumis avec succès.

# ScanningInOutOfBrowserOnlyMessage
source: Document Scanning is only available in Out-Of-Browser mode.
fr_ca: La Numérisation de document est seulement disponible dans Hors-De-le mode de Navigateur.

# FromLabel
source: From:
fr_ca: De:

# SendLabel
source: Send
fr_ca: Envoyer

# SubjectLabel
source: Subject:
fr_ca: Objet:

# TitleEmailLabel
source: Email
fr_ca: Courriel

# ToLabel
source: To:
fr_ca: Pour:

source: Call
fr_ca: Appel

source: Send Email
fr_ca: Envoyer l'e-mail

source: Send Instant Message
fr_ca: Envoyer un message instantané

# TitleSMSLabel
source: Send an SMS message
fr_ca: Envoyer un message de SMS

# ToSMSLabel
source: To:
fr_ca: A:

source: Start Scan
fr_ca: Démarrer la lecture

# FirstColumnHeader
source: FIRST
fr_ca: PREMIÈRE

# LastColumnHeader
source: LAST
fr_ca: DERNIER

# Of
source: of {0}
fr_ca: de {0}

# AddressTypeColumnHeader
source: ADDR. TYPE
fr_ca: *F* ADDR. TYPE: *F*

# MembershipStatusColumnHeader
source: MEMBER
fr_ca: MEMBRE

source: No records found!
fr_ca: Aucun dossier trouvé!

# TooManyRecordsFound
source: The search criteria you entered returns too many records. The first 500 records were returned. Please refine your search criteria.
fr_ca: Les critères de recherche entrés renvoient à un trop grand nombre de dossiers. Les 500 premiers ont été envoyés. Veuillez affiner vos critères de recherche.

# AddButton
source: Add
fr_ca: Ajouter

# DeleteButton
source: Delete
fr_ca: Supprimer

# DetailsTitle
source: Details
fr_ca: Détails

# ExtLabel
source: Ext.:
fr_ca: Poste:

# ExtTitle
source: Ext.
fr_ca: Poste

# IsCanadaUSALabel
source: Is Canada or USA
fr_ca: Canada ou É.-U.:

# MaintainContactsButton
source: Maintain Contacts
fr_ca: *F* Maintain Contacts *F*

# MaintainQuarantineButton
source: Accept
fr_ca: Accepter

# ManuallyValidatedLabel
source: Manually Validated
fr_ca: Validé manuellement

# PhoneNumberTitle
source: Phone#
fr_ca: Téléphone

# QuarantinedColonLabel
source: Quarantined:
fr_ca: En quarantaine:

# QuarantineReasonLabel
source: Quarantine Reason:
fr_ca: Raison de la quarantaine:

# RetrieveRevisionsButton
source: View History
fr_ca: Afficher l'historique

# TelephoneNumbersTitle
source: TELEPHONE NUMBERS
fr_ca: *F* TELEPHONE NUMBERS *F*

# TelephoneStatusLabel
source: Phone Status:
fr_ca: Statut du téléphone:

# WrongNumberLabel
source: Wrong Number
fr_ca: Mauvais numéro

source: None Available
fr_ca: Aucun disponible

# RidingColumnHeader
source: RIDING:
fr_ca: CIRCONSCRIPTION:

# WildcardDescription
source: ** Use the * to perform wildcard searches. A wildcard search can be performed by adding the * sign to the search criteria. (i.e. To search for a Last Name starting with 'D', enter 'D*'). Note, you cannot use the wildcard character as the first character.
fr_ca: ** Utilisez le * pour faire une recherche avec caractère de remplacement. On peut faire une recherche avec caractère de remplacement en ajoutant un * aux critères de recherche. (Par exemple, pour chercher un nom commençant par D, entrez D*.) Vous ne pouvez pas utiliser le caractère de remplacement comme premier caractère.

# InvalidPostalCode
source: Postal Code is invalid. Must be in the format A9A 9A9.
fr_ca: Le code postal est invalide. Format A9A 9A9 requis.

# SearchAddressFieldsRequired
source: Additional address criteria is required. You must provide a Postal Code or Province and Municipality to search by address only.
fr_ca: Critères d'adresse additionnels requis. Vous devez fournir un code postal ou une province ou municipalité pour faire une recherche par adresse.

# SearchFirstMiddleFriendlyNameRequired
source: Last name is required with either first name, middle name, or friendly name.
fr_ca: Le nom est requis avec le prénom, le deuxième prénom ou le nom amical.

# SearchIncludeHistoricalRequired
source: The following fields are required for historical searches: First and Last Name or Constituent ID or Mail Piece Number or Phone or Email Address
fr_ca: Les champs suivants sont requis pour les recherches historiques : Prénom et Nom ou ID d'électeur ou Numéro postal ou Téléphone ou Courriel

# SearchInterchangeFirstMiddleNameRequired
source: Middle name is required when selecting Interchange First Name and Middle Name.
fr_ca: Le deuxième prénom est requis pour interchanger le prénom et le deuxième prénom.

# SearchInternationalCountryRequired
source: You must select a Country for international searches.
fr_ca: Vous devez choisir un pays pour les recherches internationales.

# SearchPhoneNumberEmail
source: Cannot search by Phone Number if Email Address is filled in.
fr_ca: Impossible de rechercher par numéro de téléphone si le champ du courriel est rempli.

# AddAddressLabel
source: ADD
fr_ca: AJOUTER

# AddButtonLabel
source: Add
fr_ca: Ajouter

# AddressDetailsHeader
source: Address Details
fr_ca: Détail de l'adresse

# AddressLabel
source: Address
fr_ca: Adresse

# RelationshipAlreadyExistsMessage
source: A relationship to this Constituent already exists.
fr_ca: Un lien vers cet électeur existe déjà.

# AddMatchesFoundText
source: Below is a list of Constituents already in the system that may match the Constituent you are adding. If you wish to update one of these Constituents with the information you have entered, click the 'Update' button, otherwise click 'Finish' to add this Constituent.
fr_ca: Voici une liste d'électeurs déjà au système qui pourraient correspondre aux électeurs que vous ajoutez. Si vous voulez mettre l'un des électeurs à jour avec l'information entrée, cliquez sur Mettre à jour. Sinon, cliquez sur Terminer pour ajouter cet électeur.

# AddMatchesNotFoundText
source: Click the Finish button to add this Constituent to the database.
fr_ca: Cliquez sur Terminer pour ajouter cet électeur à la base de données.

# AddressesHeader
source: Addresses
fr_ca: Adresses

# AddressLine1Label
source: Address Line 1:
fr_ca: Ligne d'adresse 1:

# AddressLine2Label
source: Address Line 2:
fr_ca: Ligne d'adresse 2:

# AddressLine3Label
source: Address Line 3:
fr_ca: Ligne d'adresse 3:

# AddressStatusLabel
source: Address Status:
fr_ca: Statut de l'adresse:

# AddressTypeLabel
source: Address Type:
fr_ca: Type d'adresse:

# AllExistsMessage
source: An 'All' restriction already exists.
fr_ca: Une restriction Tous existe déjà.

# AllHeaderLabel
source: All
fr_ca: Tous

# ApplicationUpdateDownloaded
source: An application update has been downloaded and will be available the next time you start the application.
fr_ca: Une mise à jour a été téléchargée et sera disponible la prochaine fois que vous lancerez l'application.

# ApplyButton
source: Apply
fr_ca: Appliquer

# AppUserLabel
source: Application User
fr_ca: Utilisateur de l'application

# AuthenticatingUser
source: Authenticating user... Please wait...
fr_ca: Authentification de l'utilisateur… Veuillez patienter…

source: Capture Image
fr_ca: Capturer l'image

# CellPhoneHeader
source: Cell Phone:
fr_ca: Cellulaire:

# CellPhoneNumberLabel
source: Cell Phone Number:
fr_ca: Cellulaire:

# ChristmasCardRecipientLabel
source: Christmas Card Recipient
fr_ca: Récipiendaire de carte de Noël

# ClearButton
source: Clear
fr_ca: Effacer

# ConfirmationDialogQuestion
source: Are you sure you want to close this window?
fr_ca: Vous voulez vraiment fermer cette fenêtre?

# ConfirmationDialogTitle
source: Closing Confirmation
fr_ca: Confirmation de fermeture

# ConfirmConstituentPhoneTelephoneText
source: CONFIRM UPDATE TO RELATED CONSTITUENTS
fr_ca: CONFIRMER LA MISE À JOUR AVEC LES ÉLECTEURS LIÉS

# ConfirmConstituentsWithSameHomePhone
source: CONFIRM UPDATE TO CONSTITUENTS WITH RELATED HOME PHONE NUMBER
fr_ca: CONFIRMER LA MISE À JOUR AVEC LES ÉLECTEURS AYANT UN NUMÉRO DE TÉLÉPHONE LIÉ

source: Confirm Delete
fr_ca: Confirmer la suppression

# ConfirmDeleteRelationshipText
source: Are you sure you want to delete this relationship?
fr_ca: Vous voulez vraiment supprimer ce lien?

# ConfirmRestrictionDeleteText
source: Are you sure you want to delete this restriction?
fr_ca: Vous voulez vraiment supprimer cette restriction?

source: Constituent Add Failed.
fr_ca: Échec de l'ajout d'électeur.

# ConstituentCancelMessage
source: Are you sure you want to cancel?
fr_ca: Vous voulez vraiment annuler?

# ConstituentCancelTitle
source: Cancel Add
fr_ca: Annuler l'ajout

# ConstituentIDHeader
source: Constituent ID
fr_ca: ID de l'électeur

# ConstituentIDORMailPieceIDLabel
source: Constituent ID or Barcode ID:
fr_ca: ID de l'électeur ou code barres:

# ConstituentNameLabel
source: Constituent Name
fr_ca: Nom de l'électeur

# ConstituentRevisionInformationLabel
source: Constituent Revision Information
fr_ca: Information sur la révision de l'électeur

# ConstituentStatusLabel
source: Constituent Status:
fr_ca: Statut de l'électeur:

# UpdateFailed
source: Update FAILED. Another user may have updated data after you retrieved data.
fr_ca: Update failed. Un autre utilisateur peut avoir mis à jour les données après avoir récupéré des données.

# ContactRestrictionAllFieldsRequired
source: All fields are required.
fr_ca: Tous les champs sont requis.

# ContactRestrictionDetailsTitle
source: Contact Restriction Details
fr_ca: Détail de la restriction de contact

# ContinueButton
source: Continue
fr_ca: Continuer

# CountryLabel
source: Country:
fr_ca: Pays:

# CPValidAbbrevLabel
source: CPValid
fr_ca: ValidePC

# CreateCivicWithSameInfo
source: Create a Civic address with the same information
fr_ca: Créer une adresse municipale avec la même information

# CreatedColumnHeader
source: Created
fr_ca: Créée

# CreateMailingWithSameInfo
source: Create a Mailing address with the same information
fr_ca: Créer une adresse postale avec la même information

# DateAddedLabel
source: Date Created
fr_ca: Date de création

# DateOfBirthError
source: Date of Birth cannot be greater than Today.
fr_ca: La date de naissance ne peut pas être ultérieure à Aujourd'hui.

# DateOfBirthLabel
source: Date of Birth:
fr_ca: Date de naissance:

# DayOfWeekGridLabel
source: Day Of Week
fr_ca: Jour de la semaine

# DayOfWeekLabel
source: Day Of Week:
fr_ca: Jour de la semaine:

# DeceasedLabel
source: Deceased
fr_ca: Décédé

# DeleteButtonLabel
source: Delete
fr_ca: Supprimer

# DisplayConstituentSummaryTitle
source: Constituent Information
fr_ca: Information sur l'électeur

# ErrorAssigningMatchedAddress
source: An error occurred assigning the matched address.
fr_ca: Une erreur est survenue pendant l'assignation de l'adresse.

# InternationalAddressLine1Label
source: Address Line 1:
fr_ca: Ligne d'adresse 1:

# InternationalAddressLine2Label
source: Address Line 2:
fr_ca: Ligne d'adresse 2:

# InternationalAddressLine3Label
source: Address Line 3:
fr_ca: Ligne d'adresse 3:

# IsCanadaPostValidLabel
source: Canada Post Valid
fr_ca: Valide chez Postes Canada

# NoWebCamError
source: Could not start Webcam. Verify device is connected and privacy permission allow access to device.
fr_ca: Impossible de démarrer la webcam. Vérifiez si elle est connectée et que vous avez la permission d'y accéder.

# RestrictionCommunicationTypeLabel
source: Communication Type:
fr_ca: Type de communication:

# TabItemAddresses
source: Addresses
fr_ca: Adresses

# TabItemContactRestraints
source: Contact Restraints
fr_ca: Restrictions de contact

# ConfirmMatchingNewAddressTitle
source: LIST OF CONSTITUENTS WITH RELATED ADDRESS
fr_ca: LISTE D'ÉLECTEURS AVEC ADRESSES LIÉES

# ContactRestrictionEffectiveDateMessage
source: Effective End Date must be greater than Today.
fr_ca: La date de fin ne peut pas être ultérieure à Aujourd'hui.

# DeliveryInstallationAreaNameLabel
source: Delivery Installation Area Name:
fr_ca: Nom de la région de l'installation de livraison :

# DeliveryInstallationTypeLabel
source: Delivery Installation Type:
fr_ca: Type d'installation de livraison:

# DetailsLabel
source: Details
fr_ca: Détails

source: Do Not Call
fr_ca: Ne pas appeler

# DoNotCallLabel
source: Do not Call:
fr_ca: Ne pas appeler:

# DoNotCallTooltip
source: Do not call
fr_ca: Ne pas appeler

source: Do Not Email
fr_ca: Ne pas envoyer de courriel

# DoNotEmailLabel
source: Do not Email:
fr_ca: Ne pas envoyer de courriel:

# DoNotEmailTooltip
source: Do not email
fr_ca: Ne pas envoyer de courriel

# DoNotKnockCheckBoxLabel
source: Do not knock
fr_ca: Ne pas frapper

# DoNotKnockLabel
source: Do not Knock:
fr_ca: Ne pas frapper:

# DoNotKnockTooltip
source: Do not knock
fr_ca: Ne pas frapper

# DoNotMailCheckBoxLabel
source: Do Not Mail
fr_ca: Ne pas envoyer de courrier

# DoNotMailLabel
source: Do not Mail:
fr_ca: Ne pas envoyer de courrier:

# DoNotMailTooltip
source: Do not mail
fr_ca: Ne pas envoyer de courrier

# DoNotMergeLabel
source: Do Not Merge
fr_ca: Ne pas fusionner

source: Do you want to save changes?
fr_ca: Voulez-vous enregistrer les changements?

# EDNumberLabel
source: ED Number:
fr_ca: Numéro d'ACÉ:

# EffectiveDateLabel
source: Effective Date:
fr_ca: Date d'entrée en vigueur:

# EffectiveEndDateGridLabel
source: End Date
fr_ca: Date de fin

# EffectiveEndDateLabel
source: Effective End Date:
fr_ca: Date de fin:

# EffectiveStartDateLabel
source: Effective Start Date:
fr_ca: Date de début:

# ElectionCanadaAddressTypeLabel
source: EC Address Type:
fr_ca: Type d'adresse ÉC:

source: Eligible Voter
fr_ca: Électeur admissible

# EligibleVoterLabel
source: Eligible Voter
fr_ca: Électeur admissible

# EmailAddressHeaderLabel
source: Email Address
fr_ca: Adresse de courriel:

# EmailHeaderLabel
source: Email
fr_ca: Courriel

# EmailLabel
source: Email:
fr_ca: Courriel:

# EmailStatusLabel
source: Email Status:
fr_ca: Statut du courriel:

# EmailTypeLabel
source: Email Type:
fr_ca: Type de courriel:

# EthnicityLabel
source: Ethnicity:
fr_ca: Origine ethnique:

# ExpiryDateLabel
source: Expiry Date:
fr_ca: Date d'expiration:

# FinishButton
source: FINISH
fr_ca: TERMINER

# FinishHeader
source: Finish
fr_ca: Terminer

# ForcesUnitNameLabel
source: Forces Unit Name:
fr_ca: Nom de l'unité:

# FriendlyLabel
source: Friendly:
fr_ca: Amical:

# FriendlyNameLabel
source: Friendly Name:
fr_ca: Nom amical:
