Repository: mwhitesell-core/RMA-WPF
Catalog: WPF_PH.root/WPF_PH/WPF/rma/Rresource/Resources/Labels.*.resx
Languages: fr_ca

source: Full Search
fr_ca: Recherche complète

# GeoValidAbbrevLabel
source: GeoValid
fr_ca: ValideGéo

source: Get latest data and refresh view?
fr_ca: Dernières données et actualiser?

# GoodAfternoonLabel
source: Good afternoon
fr_ca: Bon après-midi

# GoodMorningLabel
source: Good morning
fr_ca: Bonjour

# Historical
source: Historical Data
fr_ca: Données historiques

# HomeLabel
source: Home
fr_ca: ACCUEIL

source: Household
fr_ca: Foyer

# HouseHoldSupportLevelLookUpLabel
source: House Hold Support Level:
fr_ca: Niveau de soutien du foyer:

# IncludeHistoricalCheckbox
source: Include Historical Revisions
fr_ca: Inclure les révisions historiques

# IncompleteAbbrevLabel
source: Incompl
fr_ca: Incomplet

# IncompleteLabel
source: Incomplete
fr_ca: Incomplet

# InterchangeFirstMiddleNamesLabel
source: Interchange First & Middle Names
fr_ca: Échange prénom & deuxième prénom

# IsGeoValidLabel
source: Geographically Valid
fr_ca: Valide géographiquement

# IsIncompleteLabel
source: Incomplete
fr_ca: Incomplet

# KnockHeaderLabel
source: Knock
fr_ca: Frapper

# LanguageLabel
source: Language:
fr_ca: Langue:

# LastUpdatedByLabel
source: Last Updated By:
fr_ca: Dernière mise à jour par:

# LastUpdatedDateTimeLabel
source: Last Updated Date/Time:
fr_ca: Date/Heure dernière mise à jour:

# LastUpdatedHeading
source: Last Updated
fr_ca: Dernière mise à jour

# LookupCacheFailedToLoad
source: Lookup cached failed to load (PreloadSet1)
fr_ca: Antémémoire non chargée (PreloadSet1)

# OverEighteenLabel
source: Eighteen and Over
fr_ca: Dix-huit et plus

# TabItemDetails
source: Details
fr_ca: Détails

# TabItemEmailAddress
source: Emails
fr_ca: Courriels

# TerminatedLabel
source: Inactive
fr_ca: Inactif

# TerminationReasonLabel
source: Inactive Reason:
fr_ca: Raison de l'inaction:

# AddMatchesFoundHeaderText
source: Matches Found
fr_ca: Correspondances trouvées

# AddMatchesNotFoundHeaderText
source: No Matches Found
fr_ca: Aucune correspondance trouvée

# AddNewConstituentStep1WelcomeText
source: Welcome to the Add New Constituent Wizard. Please fill in as many fields as possible throughout the wizard. On this screen First Name and Last Name are required.
fr_ca: Bienvenue à l'assistant Ajouter un nouvel électeur. Veuillez remplir le plus de champs possible. Le prénom et le nom sont requis à cet écran.

# AddNewConstituentWelcomeStep2WelcomeText
source: Please fill in as many details as possible. Eligible Voter, Eighteen and Over and Canadian Citizen fields are linked together.
fr_ca: Veuillez entrer le plus de détails possible. Les champs Électeur admissible, Dix-huit et plus et Citoyen canadien sont liés.

# AddNewConstituentWelcomeStep3WelcomeText
source: To add a new constituent, please enter at least one of the following:
fr_ca: Pour ajouter un électeur, vous devez au moins entrer:

# ApplicationUpdateError
source: While checking for an application update, the following message was encountered:
fr_ca: Pendant la recherche d'une mise à jour, le message suivant s'est affiché:

# CommunicationTypeLabel
source: Preferred Comm:
fr_ca: Comm. de préférence:

# ConfirmDeleteEmailText
source: This is the only Email for this Constituent. Are you sure you want to delete it?
fr_ca: C'est le seul courriel pour cet électeur. Vous voulez vraiment le supprimer?

# ConfirmDeleteLastAddress
source: This is the only Address for this constituent. Are you sure you want to delete it?
fr_ca: C'est la seule adresse pour cet électeur. Vous voulez vraiment la supprimer?

# ConfirmDeleteText
source: This is the only Phone Number for this constituent. Are you sure you want to delete it?
fr_ca: C'est le seul téléphone pour cet électeur. Vous voulez vraiment le supprimer?

# UpdateSucceeded
source: Update successful
fr_ca: Mise à jour réussie

# CouldNotStartWebcamError
source: There was a problem starting the webcam. If using a Mac, verify default device settings. Right click app to access the Configuration settings.
fr_ca: Il y a eu un problème avec le démarrage de la webcam. Si vous êtes sur Mac, vérifiez les paramètres par défaut. Avec le bouton droit de la souris, cliquez sur la pomme pour accéder aux paramètres de configuration.

# CountryRequiredForInternationalAddress
source: You must select a Country other than Canada for international addresses.
fr_ca: Vous devez choisir un pays autre que le Canada pour les adresses internationales.

# DeliveryInstallationQualifierNameLabel
source: Name:
fr_ca: Nom

# EffectiveStartDateGridLabel
source: Start Date
fr_ca: Date de début

# FinishPageWelcomeText
source: Scanning database for potential matches...
fr_ca: Recherche de correspondances dans la base de données…

# InvalidIamgeFormat
source: The image that was uploaded was in an invalid format. Please use JPG or PNG.
fr_ca: Le format de l'image téléchargée est invalide. Veuillez utiliser JPG ou PNG.

# IsManuallyValidatedLabel
source: Manually Validated
fr_ca: Validé manuellement

# LockBoxBagNumberLabel
source: P.O. Box:
fr_ca: C.P.:

# MaidenNameLabel
source: Maiden Name:
fr_ca: Nom de jeune fille:

# MailHeaderLabel
source: Mail
fr_ca: Poste

# MaintainRevisionInformationTitle
source: Maintain Revision Information
fr_ca: Conserver information révision

# ManuallyValidatedAbbrevLabel
source: Valid
fr_ca: Valide

# MaritalStatusLabel
source: Marital Status:
fr_ca: État civil:

# MemberOfParliamentLabel
source: Member Of Parliament
fr_ca: Député

# MembershipStatusLabel
source: Membership Status:
fr_ca: Statut de membre:

# MeridianLabel
source: Meridian:
fr_ca: Méridien:

# MiddleNameLabel
source: Middle Name:
fr_ca: Deuxième prénom:

# MilitaryLabel
source: Military
fr_ca: Militaire

# MotherTongueLabel
source: Mother Tongue:
fr_ca: Langue maternelle:

# MoveAddressBeforeIsResidenceError
source: You cannot move this record before the record marked as a Residence record.
fr_ca: Vous ne pouvez pas déplacer ce dossier avant le dossier de résidence.

# MoveAddressIsResidenceDownError
source: You cannot move the record marked as a Residence down in priority.
fr_ca: Vous ne pouvez pas réduire la priorité du dossier de résidence.

# MoveAddressTypeDownError
source: You cannot move this record after the next record as the address types are different.
fr_ca: Vous ne pouvez pas déplacer ce dossier après le prochain dossier car les types d'adresse sont différents.

# MoveAddressTypeUpError
source: You cannot move this record before the previous record as the address types are different.
fr_ca: Vous ne pouvez pas déplacer ce dossier avant le précédent dossier car les types d'adresse sont différents.

# MunicipalityProvincePostalCodeRequired
source: Municipality Name and Province or Postal Code is required.
fr_ca: La municipalité et la province ou le code postal sont requis.

# NameSuffixLabel
source: Name Suffix:
fr_ca: Suffixe:

# NameTitle
source: Name
fr_ca: Nom

# NEXTBUTTON
source: Navigate to the Next Record
fr_ca: Accédez à l'enregistrement suivant

# NoButton
source: No
fr_ca: Non

# NotVisibleOusideElectionWindowText
source: Not visible outside election window.
fr_ca: Non visible hors de la fenêtre électorale.

# NoUpdatesPending
source: No pending updates exist
fr_ca: Aucune mise à jour en attente

# OccupationGroupLabel
source: Occupation Group:
fr_ca: Groupe professionnel:

# OccupationLabel
source: Occupation:
fr_ca: Profession:

# OriginGridLabel
source: Origin
fr_ca: Origine

# OriginLabel
source: Origin:
fr_ca: Origine:

# PageHasValidationErrors
source: There are validation errors that need to be fixed prior to continuing.
fr_ca: Des erreurs de validation doivent être corrigées avant de continuer.

source: Party:
fr_ca: Parti:

# PartyLabel
source: Party:
fr_ca: Parti:

# PhoneNumberHeader
source: Phone #
fr_ca: Téléphone

source: Photo Source:
fr_ca: Source de la photo:

# PollKeyLabel
source: Poll Key:
fr_ca: Indicateur de vote:

# PollKeyNameLabel
source: Poll Key Name:
fr_ca: Nom de l'indicateur de vote:

# PreferredLanguageLabel
source: Preferred Language:
fr_ca: Langue de préférence:

# PreferredMunicipalityLabel
source: Preferred Municipality:
fr_ca: Municipalité de préférence:

# PREVIOUSBUTTON
source: Navigate to the Previous Record
fr_ca: Accédez à l'enregistrement précédent

# PrimaryContactNameLabel
source: Primary Contact Name:
fr_ca: Nom du contact principal:

# PrimaryContactPhoneNumberLabel
source: Primary Contact Phone Number:
fr_ca: Téléphone du contact principal:

# QuarantinedLabel
source: Quarantined
fr_ca: En quarantaine

# QuarantineReasonRequired
source: Quarantine reason cannot be blank when Quarantined.
fr_ca: La raison de la quarantaine doit être précisée.

source: Quick All
fr_ca: Tous rapide

source: Quick Search
fr_ca: Recherche rapide

# RangeLabel
source: Range:
fr_ca: Gamme:

# ReasonColumnHeader
source: Reason:
fr_ca: Raison:

# RefreshButton
source: Refresh
fr_ca: Actualiser

# RefreshConstituentData
source: Refresh all constituent data
fr_ca: Actualiser toutes les données

# RejectQuarantineButton
source: Reject
fr_ca: Rejeter

# RelatedConstituentNameLabel
source: Related Constituent Name:
fr_ca: Nom de l'électeur lié:

# RelatedHeaderLabel
source: Related
fr_ca: Lié

# RelatedTypeLabel
source: Related Type:
fr_ca: Type lié:

# RelationshipDetailsHeader
source: Relationship Details
fr_ca: Détail de la relation

# RelationshipIDLabel
source: Relationship ID:
fr_ca: ID de la relation:

# RelationshipsHeaderLowercase
source: Relationship
fr_ca: Relation

# RelationshipToOneselfMessage
source: You cannot relate a Constituent to themselves.
fr_ca: Vous ne pouvez pas relier un électeur à lui-même.

# RetrieveRevisionButton
source: View History
fr_ca: Afficher l'historique

# ReturnButton
source: Return
fr_ca: Retour

# RevisionColumnHeader
source: Revision
fr_ca: Révision

# RevisionE1
source: Revision - Unable to find matching Telephone for Constituent_Telephone
fr_ca: Révision - Impossible de trouver un téléphone correspondant à Électeur_Téléphone

# RevisionE10
source: Revision - Unable to find matching Address for Constituent_Address
fr_ca: Révision - Impossible de trouver une adresse correspondant à Électeur_Adresse

# RevisionE2
source: Revision - Unable to get TelephoneID for Constituent_Telephone
fr_ca: Révision - Impossible d'avoir l'ID de téléphone pour Électeur_Téléphone

# RevisionE3
source: Revision - Unable to find matching Address for Constituent_Address
fr_ca: Révision - Impossible de trouver une adresse correspondant à Électeur_Adresse

# RevisionE4
source: Revision - Unable to get AddressID for Constituent_Address
fr_ca: Révision - Impossible d'avoir l'ID d'adresse pour Électeur_Adresse

# RevisionE5
source: Revision - Unable to find matching Email for Constituent_Email
fr_ca: Révision - Impossible de trouver un courriel correspondant à Électeur_Courriel

# RevisionE6
source: Revision - Unable to get EmailID for Constituent_Email
fr_ca: Révision - Impossible d'avoir l'ID de courriel pour Électeur_Courriel

# RevisionE7
source: Revision - Unable to find matching constituent revision
fr_ca: Révision - Impossible de trouver une révision d'électeur correspondante

# RevisionE8
source: Revision - Unable to find specified relation revision
fr_ca: Révision - Impossible de trouver la révision de la relation

# RevisionE9
source: Revision - Unable to find specified contact-restriction revision
fr_ca: Révision - Impossible de trouver la révision de restriction de contact

# RevisionReasonLabel
source: Revision Reason
fr_ca: Raison de la révision

# RevisionReasonMessage
source: Please enter a reason for revision.
fr_ca: Veuillez entrer une raison pour la révision:

# RevisionSourceLabel
source: Revision Source:
fr_ca: Source de la révision:

# RidingLabel
source: Riding:
fr_ca: Circonscription:

# RidingLookupLabel
source: Riding:
fr_ca: Circonscription:

# RidingNumberNameLabel
source: Riding Number Name:
fr_ca: Nom numéro de la circonscription:

# RouteServiceNumberLabel
source: Service #:
fr_ca: No service:

# RouteServiceTypeLabel
source: Route Service Type:
fr_ca: Type de service:

# RuralFreeFormatPhysicalAddressLabel
source: Rural Free Format Physical Address:
fr_ca: Adresse physique sans format rural

# SearchInternationalAddressesLabel
source: Search International Addresses
fr_ca: Recherche d'adresses internationales

# SearchNameVariantsLabel
source: Search Name Variants
fr_ca: Recherche de variantes de nom

# SearchNoCriteriaEntered
source: You must enter search criteria! Please enter either ID, name, address, phone or email information.
fr_ca: Vous devez entrer des critères de recherche ! Veuillez entrer l'ID, le nom, l'adresse, le téléphone ou le courriel.

# SearchPhoneticallyLabel
source: Search Phonetically
fr_ca: Recherche phonétique

# SearchRuralAddressesLabel
source: Search Rural Addresses
fr_ca: Recherche d'adresses rurales

# SelectButtonColumn
source: Select
fr_ca: Sélectionner

source: SELECT EXISTING ADDRESS
fr_ca: SÉLECTIONNEZ UNE ADRESSE EXISTANTE

# SeniorCitizenLabel
source: Senior Citizen
fr_ca: Personne âgée

# SnowbirdLabel
source: Snowbird
fr_ca: Retraité migrateur

source: Start Camera
fr_ca: Démarrer la caméra

# StatusLabel
source: Status
fr_ca: Statut

# Step1Label
source: Step 1
fr_ca: Étape 1

# Step2Label
source: Step 2
fr_ca: Étape 2

# Step3Label
source: Step 3
fr_ca: Étape 3

source: Stop Camera
fr_ca: Arrêter la caméra

# StreetNumberSuffixLabel
source: Suffix:
fr_ca: Suffixe:

source: Subject
fr_ca: Objet

# SupportLevelLabel
source: Support Level:
fr_ca: Niveau de soutien:

# TabItemSummary
source: Summary
fr_ca: Résumé

# TabItemSupportLevel
source: Support Level
fr_ca: Niveau de soutien

# TabItemTelephones
source: Telephones
fr_ca: Téléphones

source: TBD
fr_ca: À déterminer

# TelephoneHeaderLabel
source: Telephone
fr_ca: Téléphone

# TelephoneTypeLabel
source: Phone Type:
fr_ca: Type de téléphone:

# TimeColumnHeader
source: Time
fr_ca: Heure

# TimeOfDayGridLabel
source: Time Of Day
fr_ca: Moment de la journée

# TimeOfDayLabel
source: Time Of Day:
fr_ca: Moment de la journée:

# TownshipLabel
source: Township:
fr_ca: Canton

# TroublemakerLabel
source: Troublemaker
fr_ca: Fauteur de trouble

# UndoButton
source: Undo
fr_ca: Annuler

# UnitLabel
source: Unit:
fr_ca: Unité:

source: Unsaved updates exist ...
fr_ca: Il existe des mises à jour non enregistrées…

# UpdateButtonLabelLowerCase
source: Update
fr_ca: Mise à jour

# UpdateButtonUpperLower
source: Update
fr_ca: Mise à jour

# UpdatedByLabel
source: Updated By:
fr_ca: Mise à jour par:

# UpdateErrorText
source: The update failed. You may attempt the same updates again after retrieving the latest details.
fr_ca: La mise à jour a échoué. Vous pouvez réessayer après avoir récupéré les derniers détails.

# UpdateErrorTitle
source: Update Error
fr_ca: Erreur de mise à jour

# UpdateNotificationLabel
source: Update Notification:
fr_ca: Avis de mise à jour:

# UpdatesPending
source: Pending updates exist...
fr_ca: Mises à jour en attente…

# UploadButtonLabel
source: Upload...
fr_ca: Chargement…

# UserAddedLabel
source: User Created
fr_ca: Utilisateur créé

# ValidationErrorInvalidCharacters
source: The field {0} contains invalid characters.
fr_ca: Le champ {0} comprend des caractères invalides.

# ValidationErrorMaxLengthExceeded
source: The field {0} cannot have a value greater than {1}.
fr_ca: Le champ {0} ne peut avoir une valeur supérieure à {1}.

# ValidationErrorStartsWithWildcardOrHasInvalidCharacters
source: Search cannot start with a *.
fr_ca: La recherche ne peut pas commencer par un *.

# ValidationErrorValueToLarge
source: The field {0} cannot exceed {1}.
fr_ca: Le champ {0} ne peut excéder {1}.

# ViewButton
source: View
fr_ca: Afficher

# ViewHistoryButton
source: View History
fr_ca: Afficher l'historique

# WizardAddressValidationError
source: Please enter an address for this Constituent, or click Back.
fr_ca: Veuillez entrer une adresse pour cet électeur ou retourner en arrière.

# WizardEmailValidationError
source: Please enter an email address for this Constituent, or click Back.
fr_ca: Veuillez entrer un courriel pour cet électeur ou retourner en arrière.

# WizardStep3Error
source: Please check off at least 1 box.
fr_ca: Veuillez cocher au moins une case:

# WizardTelephoneValidationError
source: Please enter a telephone number for this Constituent, or click Back.
fr_ca: Veuillez entrer un numéro de téléphone pour cet électeur ou retourner en arrière.

# WrongEmailLabel
source: Wrong Email Address
fr_ca: Mauvais courriel

# YesButton
source: Yes
fr_ca: Oui

# AddedByLabel
source: Added by
fr_ca: *F* Added by *F*

# AddedLabel
source: New
fr_ca: Nouveau

# AddNewConstituentTitle
source: Add New Constituent
fr_ca: Ajouter un nouvel électeur

# AddNoteLabel
source: Add Note
fr_ca: *F* Add Note *F*

# AddressStatusLookUpLabel
source: Address Status:
fr_ca: Statut de l'adresse:

# AlternateEnglishNameLabel
source: Alternate English Name:
fr_ca: Autre nom anglais:

# AlternateFrenchNameLabel
source: Alternate French Name:
fr_ca: Autre nom français:

source: Application Update
fr_ca: Mise à jour de l'application

# CallLabel
source: Call:
fr_ca: *F* Call: *F*

# CommunicateButton
source: COMMUNICATIONS
fr_ca: *F* COMMUNICATIONS *F*

# ConstituentIDLabel
source: Constituent ID:
fr_ca: ID de l'électeur:

# ConstituentPhotographHeader
source: CONSTITUENT PHOTOGRAPH
fr_ca: *F* CONSTITUENT PHOTOGRAPH *F*

# ContactNameHeader
source: Contact Name
fr_ca: Nom de contact

# CopyButton
source: Copy
fr_ca: Copie

# CreatedByLabel
source: Created By:
fr_ca: Créée:

# CreatedDateTimeLabel
source: Created Date/Time:
fr_ca: Date de création:

# DeleteAddressLabel
source: DELETE
fr_ca: SUPPRIMER

# DeletedLabel
source: Deleted
fr_ca: *F* Deleted *F*

# DisplaySortOrderLabel
source: Display Sort Order:
fr_ca: Ordre d'affichage:

# DoNotContactHeader
source: Do Not Contact
fr_ca: *F* Do Not Contact *F*

# DuplicateContactRestriction
source: This Contact Restriction already exists.
fr_ca: Cette restriction de contact existe déjà.

# DuplicateEmailsExist
source: You have attempted to add a duplicate Email to this Constituent. Please remove 1 before saving.
fr_ca: Vous avez essayé d'ajouter un courriel en double pour cet électeur. Veuillez en supprimer 1 avant l'enregistrement.

# DuplicateTelephonesExist
source: You have attempted to add a duplicate Telephone number to this Constituent. Please remove 1 before saving.
fr_ca: Vous avez essayé d'ajouter un numéro de téléphone en double pour cet électeur. Veuillez en supprimer 1 avant l'enregistrement.

# ECVoterIDLabel
source: EC Voter ID:
fr_ca: *F* EC Voter ID: *F*

# ElectionEventHeader
source: Election Event
fr_ca: Événement électoral

# ElectionEventLookupIdLabel
source: Election Event:
fr_ca: Événement électoral:

# ElectionEventNameLabel
source: Election Event Name:
fr_ca: Nom de l'événement électoral:

# ElectionsCanadaIDLabel
source: Elections Canada ID:
fr_ca: ID Élections Canada:

# EmailAddressDetailsLabel
source: Email Address Details
fr_ca: *F* Email Address Details *F*

# EmailAddressesLabel
source: Email Addresses
fr_ca: Adresse de courriel

# EnglishAbbreviatedNameLabel
source: English Abbreviated Name:
fr_ca: Nom français abrégé:

# EnglishNameGrid
source: English Name
fr_ca: Nom anglais

# EnglishNameLabel
source: English Name:
fr_ca: Nom anglais:

source: Extension
fr_ca: Poste

# FrenchAbbreviatedNameLabel
source: French Abbreviated Name:
fr_ca: Nom français abrégé:

# FrenchNameGrid
source: French Name
fr_ca: Nom français

# FrenchNameLabel
source: French Name:
fr_ca: Nom français:

# HouseholdSupportHeader
source: Household Support
fr_ca: Niveau de soutien

# HouseholdSupportLabel
source: Household Support Level:
fr_ca: Niveau de soutien du foyer:

# IsActiveGrid
source: Is Active
fr_ca: Actif

# IsActiveLabel
source: Is Active
fr_ca: Actif

# IsResidentialLabel
source: Residential
fr_ca: Résidentiel

# IsTroubleLabel
source: Trouble:
fr_ca: *F* Trouble *F*

# KnockLabel
source: Knock:
fr_ca: Frapper:

# LastUpdatedLabel
source: Last Updated:
fr_ca: Dernière mise à jour:

# LookupTableNameLabel
source: Table Name:
fr_ca: Nom du tableau de consultation:

# MailLabel
source: Mail:
fr_ca: Poste:

# MailPieceNumberLabel
source: Mail Piece #
fr_ca: *F* Mail Piece # *F*

# MaintainLookUps
source: Maintain Code Tables
fr_ca: Maintenir les consultations

# MaintainNotesButton
source: View Notes
fr_ca: *F* View Notes *F*

# ModifiedLabel
source: Modified
fr_ca: *F* Modified *F*

# NotesDetailsLabel
source: Notes Detail
fr_ca: Détails notes

# NoUpdatesPendingMessage
source: No updates are pending
fr_ca: Aucune mise à jour en attente.

# OccupationGroupLookupIDLabel
source: Occupation Group Lookup ID:
fr_ca: ID consultation du groupe professionnel

# OrganizationEnglishNameLabel
source: Organization English Name:
fr_ca: Nom anglais de l'organisation:

# OrganizationFrenchNameLabel
source: Organization French Name:
fr_ca: Nom français de l'organisation:

# OrganizationHeader
source: Organization
fr_ca: Organisation

# OrganizationLabel
source: Organization:
fr_ca: Organisation:

# PhoneNumberStatusLabel
source: Phone Number Status:
fr_ca: Statut du téléphone:

source: Please wait ...
fr_ca: Veuillez patienter…

# PollHeaderLabel
source: Poll
fr_ca: Scrutin

# PreferredCommModeLabel
source: Preferred Communication:
fr_ca: Comm. de préférence:

# QuarantineAndTerminationRequired
source: Quarantine Reason and Inactive Reason are required.
fr_ca: Les raisons de la quarantaine et de l'inaction sont requises.

# QuarantinedRequired
source: Quarantined Reason is required.
fr_ca: La raison de la quarantaine est requise.

# RelatedByLabel
source: Related By:
fr_ca: *F* Related By: *F*

# RelationshipsHeader
source: RELATIONSHIPS
fr_ca: RELATIONS

# ResidentialLabel
source: Residential
fr_ca: Résidentiel

# RetrieveMaintainAddressLabel
source: CONSTITUENT ADDRESSES
fr_ca: *F* CONSTITUENT ADDRESSES *F*

# RidingHeaderLabel
source: Riding
fr_ca: Circonscription

# SaveAddressLabel
source: SAVE
fr_ca: *F* SAVE *F*

# SaveButtonLabel
source: Save
fr_ca: *F* Save *F*

# SaveNoteLabel
source: Save Note
fr_ca: *F* Save Note *F*

# SearchMyRidingCheckbox
source: My Riding Only
fr_ca: *F* My Riding Only *F*

# SearchTermsLabel
source: SEARCH TERMS
fr_ca: TERMES DE RECHERCHE

source: Show Advanced Fields?
fr_ca: *F* Show Advanced Fields? *F*

# SysAdminButton1
source: INSTRUCTIONS: Maintain system
fr_ca: INSTRUCTIONS : Maintenir les propriétés

# SysAdminButton2
source: properties.
fr_ca: du système.

# SysAdministration
source: System Administration
fr_ca: Administration du système

source: SYSTEM ADMINISTRATION
fr_ca: ADMINISTRATION DU SYSTÈME

# TabItemSysAdmin
source: SYSTEM ADMIN
fr_ca: ADMIN SYSTÈME

# TerminationRequired
source: Inactive Reason is required.
fr_ca: La raison de l'inaction est requise.

# UnchangedLabel
source: Unchanged
fr_ca: *F* Unchanged *F*

# UseWebcamButtonLabel
source: Use Webcam...
fr_ca: *F* Use Webcam... *F*

# VotingLocationLabel
source: Voting Location:
fr_ca: Emplacement de vote

# VotingLocationsDetailsTitle
source: Voting Locations Detail
fr_ca: Détail des emplacements de vote

# VotingLocationsTitle
source: Maintain Voting Locations
fr_ca: Emplacements de vote

# WebcamTitle
source: Webcam
fr_ca: *F* Webcam *F*

# EffectiveDateHeader
source: Effective Date
fr_ca: Date d'entrée en vigueur

# ConAdminButton1
source: INSTRUCTIONS: Maintain content
fr_ca: Instructions : Maintenez des

# ConAdminButton2
source: properties.
fr_ca: propriétés de contexte

# ContextAdministration
source: CONTENT ADMINISTRATION
fr_ca: ADMINISTRATION DU CONTEXTE

# TabItemConAdmin
source: CONTENT ADMIN
fr_ca: ADMIN CONTEXTE

# AddLocationButton
source: Add Location
fr_ca: Ajouter lieu

# AddressingRuleLabel
source: Addressing Rule:
fr_ca: Règle d'adresse:

# AlternateFirstNameLabel
source: Alternate First Name:
fr_ca: Prénom remplaçant:
